{
  "book_id": 51,
  "book_uuid": "3e9650d1-0619-4b3f-8de9-a9b39575ca2f",
  "title": "The Unicorn Project: A Novel About Developers, Digital Disruption, and Thriving in the Age of Data",
  "pubdate": "2019-03-15 04:00:00+00:00",
  "isbn": "",
  "author_name": "Gene Kim",
  "publisher_name": "IT Revolution",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "General",
    "Computers",
    "System Administration",
    "Business & Economics",
    "Production & Operations Management",
    "Management",
    "Industries",
    "Computers & Information Technology",
    "Leadership",
    "Workplace Culture",
    "Backup & Recovery"
  ],
  "description": "<div>\n<p>The Phoenix Project wowed over a half-million readers. Now comes the Wall Street Journal Bestselling The Unicorn Project! \"The Unicorn Project is amazing, and I loved it 100 times more than The Phoenix Project...\"--FERNANDO CORNAGO, Senior Director Platform Engineering, Adidas \"Gene Kim does a masterful job of showing how ... the efforts of many create lasting business advantages for all. </p>\n<p>\"--DR. STEVEN SPEAR, author of The High-Velocity Edge, Sr. Lecturer at MIT, and principal of HVE LLC. \"The Unicorn Project is so clever, so good, so crazy enlightening!\"--CORNELIA DAVIS, Vice President Of Technology at Pivotal Software, Inc., Author of Cloud Native Patterns This highly anticipated follow-up to the bestselling title The Phoenix Project takes another look at Parts Unlimited, this time from the perspective of software development. In The Unicorn Project, we follow Maxine, a senior lead developer and architect, as she is exiled to the Phoenix Project, to the horror of her friends and colleagues, as punishment for contributing to a payroll outage. She tries to survive in what feels like a heartless and uncaring bureaucracy and to work within a system where no one can get anything done without endless committees, paperwork, and approvals. One day, she is approached by a ragtag bunch of misfits who say they want to overthrow the existing order, to liberate developers, to bring joy back to technology work, and to enable the business to win in a time of digital disruption. To her surprise, she finds herself drawn ever further into this movement, eventually becoming one of the leaders of the Rebellion, which puts her in the crosshairs of some familiar and very dangerous enemies. The Age of Software is here, and another mass extinction event looms--this is a story about rebel developers and business leaders working together, racing against time to innovate, survive, and thrive in a time of unprecedented uncertainty...and opportunity. \"The Unicorn Project provides insanely useful insights on how to improve your technology business. </p>\n<p>\"--DOMINICA DEGRANDIS, author of Making Work Visible and Director of Digital Transformation at Tasktop ------ \"My goal in writing The Unicorn Project was to explore and reveal the necessary but invisible structures required to make developers (and all engineers) productive, and reveal the devastating effects of technical debt and complexity. I hope this book can create common ground for technology and business leaders to leave the past behind, and co-create a better future together. </p>\n<p>\"--Gene Kim, November 2019</p></div>"
}