{
  "book_id": 76,
  "book_uuid": "9925fdc1-3214-4557-b521-261668b8e05e",
  "title": "The DataOps Revolution: Delivering the Data-Driven Enterprise",
  "pubdate": "2021-08-05 21:11:52.997873+00:00",
  "isbn": "",
  "author_name": "Simon Trewin",
  "publisher_name": "CRC Press",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "DataOps is a new way of delivering data and analytics that is proven to get results. It enables IT and users to collaborate in the delivery of solutions that help organisations to embrace a data-driven culture. The DataOps Revolution: Delivering the Data-Driven Enterprise is a narrative about real world issues involved in using DataOps to make data-driven decisions in modern organisations. The book is built around real delivery examples based on the author’s own experience and lays out principles and a methodology for business success using DataOps. Presenting practical design patterns and DataOps approaches",
    "the book shows how DataOps projects are run and presents the benefits of using DataOps to implement data solutions. Best practices are introduced in this book through the telling of a story",
    "which relates how a lead manager must find a way through complexity to turn an organisation around. This narrative vividly illustrates DataOps in action",
    "enabling readers to incorporate best practices into everyday projects. The book tells the story of an embattled CIO who turns to a new and untested project manager charged with a wide remit to roll out DataOps techniques to an entire organisation. It illustrates a different approach to addressing the challenges in bridging the gap between IT and the business. The approach presented in this story lines up to the six IMPACT pillars of the DataOps model that Kinaesis (www.kinaesis.com) has been using through its consultants to deliver successful projects and turn around failing deliveries. The pillars help to organise thinking and structure an approach to project delivery. The pillars are broken down and translated into steps that can be applied to real-world projects that can deliver satisfaction and fulfillment to customers and project team members. DataOps is a new way of delivering data and analytics that is proven to get results. It enables IT and users to collaborate in the delivery of solutions that help organizations",
    "cloud technology; communication plans; controlled empowerment; data governance; data-driven enterprise; DataOps model; DataOps Revolution; IT professionals; momentum; technical Iterations",
    "Computers",
    "Data Science",
    "Data Analytics",
    "Data Warehousing"
  ],
  "description": "<p>DataOps is a new way of delivering data and analytics that is proven to get results. It enables IT and users to collaborate in the delivery of solutions that help organisations to embrace a data-driven culture. The DataOps Revolution: Delivering the Data-Driven Enterprise is a narrative about real world issues involved in using DataOps to make data-driven decisions in modern organisations. The book is built around real delivery examples based on the author’s own experience and lays out principles and a methodology for business success using DataOps. Presenting practical design patterns and DataOps approaches, the book shows how DataOps projects are run and presents the benefits of using DataOps to implement data solutions. Best practices are introduced in this book through the telling of a story, which relates how a lead manager must find a way through complexity to turn an organisation around. This narrative vividly illustrates DataOps in action, enabling readers to incorporate best practices into everyday projects. The book tells the story of an embattled CIO who turns to a new and untested project manager charged with a wide remit to roll out DataOps techniques to an entire organisation. It illustrates a different approach to addressing the challenges in bridging the gap between IT and the business. The approach presented in this story lines up to the six IMPACT pillars of the DataOps model that Kinaesis (www.kinaesis.com) has been using through its consultants to deliver successful projects and turn around failing deliveries. The pillars help to organise thinking and structure an approach to project delivery. The pillars are broken down and translated into steps that can be applied to real-world projects that can deliver satisfaction and fulfillment to customers and project team members.</p>"
}