{
  "book_id": 685,
  "book_uuid": "6f8f9823-ef29-497d-8b66-ba70a7dc2a4d",
  "title": "XML and Web Technologies for Data Sciences With R",
  "pubdate": "2013-11-29 14:12:29.011320+00:00",
  "isbn": "",
  "author_name": "Deborah Nolan",
  "publisher_name": "Springer Science & Business Media",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "General",
    "Computers",
    "Mathematics",
    "Probability & Statistics",
    "Languages",
    "Stochastic Processes",
    "Mathematical & Statistical Software"
  ],
  "description": "<p>Web technologies are increasingly relevant to scientists working with data, for both accessing data and creating rich dynamic and interactive displays. The XML and JSON data formats are widely used in Web services, regular Web pages and JavaScript code, and visualization formats such as SVG and KML for Google Earth and Google Maps. In addition, scientists use HTTP and other network protocols to scrape data from Web pages, access REST and SOAP Web Services, and interact with NoSQL databases and text search applications. This book provides a practical hands-on introduction to these technologies, including high-level functions the authors have developed for data scientists. It describes strategies and approaches for extracting data from HTML, XML, and JSON formats and how to programmatically access data from the Web. Along with these general skills, the authors illustrate several applications that are relevant to data scientists, such as reading and writing spreadsheet documents both locally and via Google Docs, creating interactive and dynamic visualizations, displaying spatial-temporal displays with Google Earth, and generating code from descriptions of data structures to read and write data. These topics demonstrate the rich possibilities and opportunities to do new things with these modern technologies. The book contains many examples and case-studies that readers can use directly and adapt to their own work. The authors have focused on the integration of these technologies with the R statistical computing environment. However, the ideas and skills presented here are more general, and statisticians who use other computing environments will also find them relevant to their work.</p>\n\n<p>Deborah Nolan is Professor of Statistics at University of California, Berkeley.</p>\n\n<p>Duncan Temple Lang is Associate Professor of Statistics at University of California, Davis and has been a member of both the S and R development teams.</p>"
}