{
  "book_id": 710,
  "book_uuid": "0cc244fb-40a9-4974-ab2f-55188f2a1678",
  "title": "The Road to Dune",
  "pubdate": "2005-01-02 00:00:00+00:00",
  "isbn": "",
  "author_name": "Kevin J. Anderson;Brian Herbert;Frank Herbert",
  "publisher_name": "Tor Science Fiction",
  "series_name": "",
  "series_index": 1.0,
  "tags": [],
  "description": "<h3>From Publishers Weekly</h3><p>This companion volume to Frank Herbert's 1965 science fiction classic collects manuscript material, correspondence and cut chapters related to Dune as well as previously published Dune-related short stories coauthored by his son Brian and Kevin J. Anderson. Particularly interesting are texts related to Dune's publication, including letters, reviews and press releases that acknowledge the dizzying scope of the ambitious novel. Its length meant that Herbert had a hard time placing it, and he ended up selling it to automotive-guide publisher Chilton, but its publication-and the awards it won-ushered in a new era for science fiction publishing. The sheer novelty of Dune stands in contrast to B. Herbert and Anderson's Spice Planet, an alternate Dune novelette constructed from Herbert's original notes and a by-the-numbers action-adventure of interest only in contrast to the book Herbert ultimately wrote. Three of B. Herbert and Anderson's short stories bridge some of the events in their coauthored novel prequels; the fourth takes place during one of the battles in Dune and provides an interesting point-of-view switch. Although this miscellany of material fails to cohere, the glimpse it provides into Herbert's thoughts and the difficulty of writing and publishing illuminate one of the most important SF novels ever published.<br />Copyright © Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. </p><h3>From Booklist</h3><p>This collection of essays, stories, and selections from Herbert's papers will certainly be high-priority reading for <em>Dune</em> fans. It includes two versions of <em>Spice Planet,</em> an unpublished novel containing many elements that later appeared in <em>Dune,</em> but that is a separate story. Of particular interest are the communications between Herbert, John Campbell, and others during and after the release of <em>Dune</em> and unpublished sequences from <em>Dune</em> and <em>Dune Messiah.</em> The collection also includes four short stories laid in the Butlerian Jihad era. <em>Dune</em> was a social and publishing phenomenon; it moved sf into general publishing (and marketing) awareness and spurred a wide public awareness of ecological balance. This account of its genesis should interest fans and students of popular culture. <em>Frieda Murray</em><br /><em>Copyright © American Library Association. All rights reserved</em></p>"
}