{
  "book_id": 820,
  "book_uuid": "60d5854a-9e8a-42e9-aeb9-7dee8a183396",
  "title": "Arc Welding Processes Handbook",
  "pubdate": "2021-10-12 04:00:00+00:00",
  "isbn": "",
  "author_name": "Ramesh Singh",
  "publisher_name": "John Wiley & Sons",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "General",
    "Technology & Engineering",
    "Materials Science",
    "Science",
    "Chemistry",
    "Mechanical",
    "Metals & Alloys"
  ],
  "description": "<div>\n<p>ARC WELDING PROCESSES HANDBOOK An applied reference, each part of this Handbook gives valuable information regarding the industry or industries where the process is commonly used as well as a description of the equipment. Written by a welding/metallurgical engineer with over 40 years of experience, Arc Welding Processes Handbook delivers the welding and materials expertise required to master complex welding processes and techniques to ensure that the task is done correctly and safely, while reinforcing an understanding of international welding standards and rules. The perfect handbook for those professionals who need an up-to-date reference to advance processes as well as those welders new to the field and need to hone their skills. Arc Welding Processes Handbook five-part treatment starts with a clear and rigorous exposition of the applications and equipment of Shielded Metal Arc Welding (SMAW) and Gas Tungsten Arc Welding (GTAW), followed by self-contained parts concerning processes applications and equipment for Gas Metal Arc Welding (GMAW), Flux Core Arc Welding (FCAW), and Submerged Arc welding (SAW). An applied reference, each Part of Arc Welding Processes Handbook offers valuable information regarding the industry or industries where the process is commonly used as well as a description of the equipment. In addition, this Handbook discusses the challenges presented by a number of corrosion-resistant alloys (CRAs). Case studies are included throughout the reference to reinforce an understanding of how these processes were applied in the field and how they intersect with issues that may arise with equipment use and materials. The reader will also find in the Handbook: Highlights the key advantages and limitations of each process and suggests an alternate approach to overcome those limitations One-of-a-kind case studies to reinforce an understanding of international welding standards and rules. Quality of welds, type of equipment, materials, and inspection and testing for each process. Metal joining processes like soldering and brazing. Audience The intended market for this book is professionals working in shipbuilding, construction of buildings, bridges, and other structures and to join pipes in pipelines, power plants, manufacturing, and repair.</p></div>"
}