{
  "book_id": 836,
  "book_uuid": "8d14e437-9bf3-4d81-90a4-e279a7c6e071",
  "title": "Recycling Projects for the Evil Genius",
  "pubdate": "2010-09-02 19:46:57.846356+00:00",
  "isbn": "",
  "author_name": "Russel Gehrke",
  "publisher_name": "McGraw-Hill Education",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Technology & Engineering",
    "0071736123",
    "9780071736121",
    "9780071736138",
    "B0045UWYAA",
    "Telecommunications"
  ],
  "description": "<p>Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product.</p>\n\n<p>Have some thoroughly green evil fun!This wickedly inventive guide explains how to create a variety of practical, environmentally friendly items you can use for yourself or resell for profit. Recycling Projects for the Evil Genius is filled with detailed directions on how to successfully complete each green project and discusses important safety issues.</p>\n\n<p>Using easy-to-find components and tools, this do-it-yourself book shows you how to brew up green cleaners, transform all types of paper into building materials, safety rid your home and yard of pests, and much more--all on the cheap!Recycling Projects for the Evil Genius:Features step-by-step instructions and helpful illustrationsCovers essential safety measuresReveals the scientific principles behind the projectsRemoves the frustration factor--all required parts are listed, along with sourcesMake your own green:Household cleanersLaundry soapCitrus oil extractPest and weed control solutionsRecycled plastic lumber and landscape blocksRecycled asphalt shingle paver bricks and road patch compoundConcrete paper mache blocks, garden walls, stepping stones, and structuresSolar-powered composterGarden-friendly charcoal And moreEach fun, inexpensive, and slightly wicked Evil Genius project includes a detailed list of materials, sources for parts, schematics, and lots of clear, well-illustrated instructions for easy assembly. The larger workbook-style layout and convenient two-column format make following the step-by-step instructions a breeze.</p>"
}