{
  "book_id": 842,
  "book_uuid": "850e5510-81ee-4d7e-b1bc-0340a00b874e",
  "title": "The Art of Writing Reasonable Organic Reaction Mechanisms",
  "pubdate": "2007-07-31 04:00:00+00:00",
  "isbn": "",
  "author_name": "Robert B. Grossman",
  "publisher_name": "Springer Science & Business Media",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Technology & Engineering",
    "Medical",
    "Science",
    "Life Sciences",
    "Chemistry",
    "Textiles & Polymers",
    "Organic",
    "Inorganic",
    "Biochemistry",
    "Pharmacology"
  ],
  "description": "<div>\n<p>Intended for students of intermediate organic chemistry, this text shows how to write a reasonable mechanism for an organic chemical transformation. The discussion is organized by types of mechanisms and the conditions under which the reaction is executed, rather than by the overall reaction as is the case in most textbooks. The treatment emphasizes unifying principles, showing how common mechanisms link seemingly disparate reactions. Each chapter discusses common mechanistic pathways and suggests practical tips for drawing them. Worked problems are included in the discussion of each mechanism, and \"common error alerts\" are scattered throughout the text to warn readers about pitfalls and misconceptions that bedevil students. Each chapter is capped by a large problem set. The author has drawn on his own research and the current literature to ensure that appropriate attention is given to topics across the range of modern organic chemistry. The text is unique in its inclusion of a chapter on reactions mediated or catalyzed by transition metals, an area in which mechanistic understanding is now essential. Relatively new topics such as olefin metathesis and cycloaromatization are covered without giving short shrift to more traditional areas such as carbonyl chemistry. The text assumes a basic knowledge of organic chemistry. It can be used either in a formal course or by students working on their own, and will be particularly useful for graduate students studying for qualifying examinations. It will also be useful to students and researchers in biochemistry, pharmacology, and inorganic chemistry. \"This is an excellent and well-presented work.... The author ... has succeeded well in treating the central ideas of reactivity and selectivity in an integrated whole. The clear style of writing, the well chosen examples, and the ... concise summaries of the main points provided at the end of each chapter should enable the reader to easily consolidate what has been learned.... The book is indeed a little work of art. </p>\n<p>\" -- Jens Hartung, Angewandte Chemie International Edition \"I have taught a one-credit course with this book for three years, and, uniformly, the students have rated this book highly for its clarity and for the scope of the problems. ... This book does an excellent job at its stated goal: 'to teach students to come up with reasonable mechanisms for reactions they have never seen before.'\" -- Amy Howell, Synthesis \"I have just finished my first year of graduate studies in organic chemistry at Duke University. I just wanted to let you know how much your book got me through the past year of course work.... When it came to mechanisms, I found the clarity and thoroughness I needed only in your book. It was impressive how you were able to present so much information in a clear and comprehensive manner yet keep the book so manageable in size. In addition to the text, I also was able to benefit from the problems.... Great practice!! The on-line answers are much better than looking up answers by reference.... I am reading it again this summer in preparation for my preliminary exam next spring. </p>\n<p>\" -- David Gooden</p></div>"
}