{
  "book_id": 845,
  "book_uuid": "92a3ea32-cf9d-418c-b0fc-b1d81dd0ea05",
  "title": "Physicochemical Fluid Dynamics in Porous Media: Applications in Geosciences and Petroleum Engineering",
  "pubdate": "2018-12-07 20:29:34.575573+00:00",
  "isbn": "",
  "author_name": "Mikhail Panfilov",
  "publisher_name": "John Wiley & Sons",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "General",
    "Science",
    "Chemistry",
    "Mechanics"
  ],
  "description": "<p>A unique and timely book on understanding and tailoring the flow of fluids in porous materials   Porous media play a key role in chemical processes, gas and water purification, gas storage and the development of new multifunctional materials. Understanding hydrodynamics in porous media is decisive for enabling a wide range of applications in materials science and chemical engineering. This all-encompassing book offers a timely overview of all flow and transport processes in which chemical or physicochemical phenomena such as dissolution, phase transition, reactions, adsorption, diffusion, capillarity, and surface phenomena are essential. It brings together both theoretical and experimental results and includes important industrial applications.   Physicochemical Fluid Dynamics in Porous Media: Applications in Geoscience and Petroleum Engineering explains the thermodynamics of phase equilibria for multicomponent fluids, physicochemical models of single-phase and immiscible two-phase flow, based on the macroscopic theory of oil displacement by water. It also covers the theory of two-phase flow with partial miscibility and describes partially miscible flows with phase transitions by means of the negative saturation approach. The final chapters are devoted to flow with chemical reactions, based on the example of in-situ leaching of uranium, and flow with bio-chemical reactions in terms of the underground storage of hydrogen.   -Brings together the theoretical and experimental results necessary for the understanding of hydrodynamics in porous media  -Covers important industrial applications such as underground leaching of uranium and underground storage of hydrogen  -Presents a state-of-the-art overview and summarizes the research results usually found only scattered in the literature   Physicochemical Fluid Dynamics in Porous Media: Applications in Geoscience and Petroleum Engineering will appeal to chemical engineers, materials scientists, applied physicists, and mechanical engineers.</p>"
}