{
  "book_id": 899,
  "book_uuid": "df8d6bac-27bc-467f-ab58-e6f7f9355ec3",
  "title": "Engineering for Extremes: Decision-Making in an Uncertain World",
  "pubdate": "2021-12-16 05:00:00+00:00",
  "isbn": "",
  "author_name": "Mark G. Stewart",
  "publisher_name": "Springer Nature",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "General",
    "Technology & Engineering",
    "Engineering (General)",
    "Science",
    "Environmental",
    "Environmental Science",
    "Fire Science",
    "Natural Disasters",
    "Nature"
  ],
  "description": "<div>\n<p>The volume explains how risk and decision-making analytics can be applied to the wicked problem of protecting infrastructure and society from extreme events. There is increasing research that takes into account the risks associated with the timing and severity of extreme events in engineering to reduce the vulnerability or increase the resiliency of infrastructure. \"Engineering for extremes\" is defined as measures taken to reduce the vulnerability or increase the resiliency of built infrastructure to climate change, hurricanes, storms, floods, earthquakes, heat waves, fires, and malevolent and abnormal events that include terrorism, gas explosions, vehicle impact and vehicle overload. The book introduces the key concepts needed to assess the economic and social well-being risks, costs and benefits of infrastructure to extreme events. This includes hazard modelling (likelihood and severity), infrastructure vulnerability, resilience or exposure (likelihood and extent of damage), social and economic loss models, risk reduction from protective measures, and decision theory (cost-benefit and utility analyses). Case studies authored by experts from around the world describe the practical aspects of risk assessment when deciding on the most cost-efficient measures to reduce infrastructure vulnerability to extreme events for housing, buildings, bridges, roads, tunnels, pipelines, and electricity infrastructure in the developed and developing worlds.</p></div>"
}