{
  "book_id": 903,
  "book_uuid": "7a1f71ba-11d2-4943-a04d-44067b08f30c",
  "title": "Atomic Layer Processing: Semiconductor Dry Etching Technology",
  "pubdate": "2021-04-21 04:00:00+00:00",
  "isbn": "",
  "author_name": "Thorsten Lill",
  "publisher_name": "John Wiley & Sons",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "General",
    "Technology & Engineering",
    "Materials Science",
    "Science",
    "Chemistry",
    "Mechanical",
    "Thin Films; Surfaces & Interfaces"
  ],
  "description": "<div>\n<p>Learn about fundamental and advanced topics in etching with this practical guide Atomic Layer Processing: Semiconductor Dry Etching Technology delivers a hands-on, one-stop resource for understanding etching technologies and their applications. The distinguished scientist, executive, and author offers readers in-depth information on the various etching technologies used in the semiconductor industry, including thermal, isotropic atomic layer, radical, ion-assisted, and reactive ion etching. The book begins with a brief history of etching technology and the role it has played in the information technology revolution, along with a collection of commonly used terminology in the industry. It then moves on to discuss a variety of different etching techniques, before concluding with discussions of the fundamentals of etching reactor design and newly emerging topics in the field such as the role played by artificial intelligence in the technology. Atomic Layer Processing includes a wide variety of other topics as well, all of which contribute to the author's goal of providing the reader with an atomic-level understanding of dry etching technology sufficient to develop specific solutions for existing and emerging semiconductor technologies. Readers will benefit from: A complete discussion of the fundamentals of how to remove atoms from various surfaces An examination of emerging etching technologies, including laser and electron beam assisted etching A treatment of process control in etching technology and the role played by artificial intelligence Analyses of a wide variety of etching methods, including thermal or vapor etching, isotropic atomic layer etching, radical etching, directional atomic layer etching, and more Perfect for materials scientists, semiconductor physicists, and surface chemists, Atomic Layer Processing will also earn a place in the libraries of engineering scientists in industry and academia, as well as anyone involved with the manufacture of semiconductor technology. The author's close involvement with corporate research &amp; development and academic research allows the book to offer a uniquely multifaceted approach to the subject.</p></div>"
}