{
  "book_id": 932,
  "book_uuid": "03c210c5-2314-49cc-8a9d-342d19b69f0c",
  "title": "Handbook of Borehole Acoustics and Rock Physics for Reservoir Characterization",
  "pubdate": "2018-04-28 20:47:54.250556+00:00",
  "isbn": "",
  "author_name": "Vimal Saxena",
  "publisher_name": "Elsevier",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "General",
    "Science",
    "Physics",
    "Handbook of Borehole Acoustics and Rock Physics for Reservoir Characterization",
    "(2018) i-ii. doi:10.1016/B978-0-12-812204-4.09988-3",
    "Earth Sciences",
    "Geophysics"
  ],
  "description": "<p>The Handbook of Borehole Acoustics and Rock Physics for Reservoir Characterization combines in a single useful handbook the multidisciplinary domains of the petroleum industry, including the fundamental concepts of rock physics, acoustic logging, waveform processing, and geophysical application modeling through graphical examples derived from field data. It includes results from core studies, together with graphics that validate and support the modeling process, and explores all possible facets of acoustic applications in reservoir evaluation for hydrocarbon exploration, development, and drilling support. The Handbook of Borehole Acoustics and Rock Physics for Reservoir Characterization serves as a technical guide and research reference for oil and gas professionals, scientists, and students in the multidisciplinary field of reservoir characterization through the use of petrosonics. It overviews the fundamentals of borehole acoustics and rock physics, with a focus on reservoir evaluation applications, explores current advancements through updated research, and identifies areas of future growth. - Presents theory, application, and limitations of borehole acoustics and rock physics through field examples and case studies - Features \"Petrosonic Workflows\" for various acoustic applications and evaluations, which can be easily adapted for practical reservoir modeling and interpretation - Covers the potential advantages of acoustic-based techniques and summarizes key results for easy geophysical application</p>"
}