{
  "book_id": 934,
  "book_uuid": "22703c73-542c-49e8-8a04-964596924aec",
  "title": "Gnucash 2.4 Small Business Accounting: Beginner's Guide",
  "pubdate": "2011-02-09 23:15:56.656963+00:00",
  "isbn": "",
  "author_name": "Ashok Ramachandran",
  "publisher_name": "Packt Publishing",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Computers",
    "Desktop Applications",
    "Personal Finance Applications"
  ],
  "description": "<p>Annotation Attention, small business owners! Stop tax-day stress. Stop procrastinating with a shoebox full of receipts. Stop reinventing the wheel with a spreadsheet. Stop making decisions simply on a hunch. Stop wasting money on software that is overkill. Start by downloading GnuCash and getting your accounts in order. Designed to be easy to use, yet powerful and flexible, GnuCash allows you to track bank accounts, income, and expenses. As quick and intuitive to use as a checkbook register, it is based on professional accounting principles to ensure balanced books and accurate reports. You can do it and Gnucash 2.4 Small Business Accounting Beginner's Guide will help you get up and running with maintaining your accounts.</p>\n\n<p>Gnucash 2.4 Small Business Accounting Beginner's Guide speaks business language, not accountant-speak, because it is written by a former small business owner. It guides you to use GnuCash from scratch with step-by-step tutorials without jargon, pointing out the gotchas to avoid with lots of tips. It will teach you to work on routine business transactions while migrating transaction data from other applications gradually. You will be able to keep on top of transactions and run reports after reading just three chapters!Beyond Chapter 3, it is up to you how far you want to go. Reconcile with your bank and credit card statements. Charge and pay sales tax. Do invoicing. Track payments due. Set up reminders for bills. Avoid stress at tax time. Print checks. Capture expenses using your mobile phone.</p>\n\n<p>Gnucash 2.4 Small Business Accounting Beginner's Guide gives you the power. Know your numbers. Make decisions with confidence. Drive your business to its full potential.</p>\n\n<p>Get your accounts in order and avoid tax-day stress with this hands-on guide to GnuCash, the best free accounts software in the world.</p>"
}