{
  "book_id": 1202,
  "book_uuid": "95e09a74-b552-4e91-a25e-94d759d6cba5",
  "title": "Beginning Robotics With Raspberry Pi and Arduino: Using Python and OpenCV",
  "pubdate": "2018-04-23 04:00:00+00:00",
  "isbn": "",
  "author_name": "Jeff Cicolani",
  "publisher_name": "Apress",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "General",
    "Computers",
    "Hardware"
  ],
  "description": "<div>\n<p>Learn how to use a Raspberry Pi in conjunction with an Arduino to build a basic robot with advanced capabilities. Getting started in robotics does not have to be difficult. This book is an insightful and rewarding introduction to robotics and a catalyst for further directed study. You'll be led step by step through the process of building a robot that uses the power of a Linux based computer paired with the simplicity of Arduino. You’ll learn why the Raspberry Pi is a great choice for a robotics platform; its strengths as well as its shortcomings; how to overcome these limitations by implementing an Arduino; and the basics of the Python programming language as well as some of the more powerful features. </p>\n<p>With the Raspberry Pi you can give your project the power of a Linux computer, while Arduino makes interacting with sensors and motors very easy. These two boards are complimentary in their functions; where one falters the other performs admirably. </p>\n<p>The book also includes references to other great works to help further your growth in the exciting, and now accessible, field of smart robotics. As a bonus, the final chapter of the book demonstrates the real power of the Raspberry Pi by implementing a basic vision system. Using OpenCV and a standard USB web cam, you will build a robot that can chase a ball. </p>\n<p>What You'll LearnInstall Raspbian, the operating system that drives the Raspberry PiDrive motors through an I2C motor controllerRead data through sensors attached to an ArduinoWho This Book Is For Hobbyists and students looking for a rapid start in robotics. It assumes no technical background. Readers are guided to pursue the areas that interest them in more detail as they learn.</p></div>"
}