{
  "book_id": 1239,
  "book_uuid": "2597eb0e-37bf-4c97-a1df-dabd57625cbb",
  "title": "RabbitMQ in Depth",
  "pubdate": "2017-09-18 04:00:00+00:00",
  "isbn": "",
  "author_name": "Gavin M. Roy",
  "publisher_name": "Simon and Schuster",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "General",
    "Computers",
    "Data Science",
    "Business & Productivity Software",
    "Networking",
    "Database Administration & Management",
    "Software Development & Engineering",
    "Programming",
    "System Administration",
    "Languages",
    "Java",
    "Backup & Recovery",
    "Internet",
    "Computer Architecture",
    "Open Source",
    "Web Services & APIs",
    "Operating Systems"
  ],
  "description": "<div>\n<p>SummaryRabbitMQ in Depth is a practical guide to building and maintaining message-based applications. This book provides detailed coverage of RabbitMQ with an emphasis on why it works the way it does. </p>\n<p>Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. </p>\n<p>About the TechnologyAt the heart of most modern distributed applications is a queue that buffers, prioritizes, and routes message traffic. RabbitMQ is a high-performance message broker based on the Advanced Message Queueing Protocol. It?s battle tested, ultrafast, and powerful enough to handle anything you can throw at it. It requires a few simple setup steps, and you can instantly start using it to manage low-level service communication, application integration, and distributed system message routing. </p>\n<p>About the BookRabbitMQ in Depth is a practical guide to building and maintaining message-based applications. This book provides detailed coverage of RabbitMQ with an emphasis on why it works the way it does. You'll find examples and detailed explanations based in real-world systems ranging from simple networked services to complex distributed designs. You'll also find the insights you need to make core architectural choices and develop procedures for effective operational management. What's InsideAMQP, the Advanced Message Queueing ProtocolCommunicating via MQTT, Stomp, and HTTPValuable troubleshooting techniquesDatabase integrationAbout the ReaderWritten for programmers with a basic understanding of messaging-oriented systems. </p>\n<p>About the AuthorGavin M. Roy is an active, open source evangelist and advocate who has been working with internet and enterprise technologies since the mid-90s. Technical editor James Titcumb is a freelance developer, trainer, speaker, and active contributor to open source projects. </p>\n<p>Table of ContentsPART 1 - RABBITMQ AND APPLICATION ARCHITECTUREFoundational RabbitMQ How to speak Rabbit: the AMQ Protocol An in-depth tour of message properties Performance trade-offs in publishing Don't get messages; consume them Message patterns via exchange routing PART 2 - MANAGING RABBITMQ IN THE DATA CENTER OR THE CLOUDScaling RabbitMQ with clusters Cross-cluster message distribution PART 3 - INTEGRATIONS AND CUSTOMIZATIONUsing alternative protocols Database integrations</p></div>"
}