{
  "book_id": 1525,
  "book_uuid": "536f5a9f-ff90-47ba-8765-3d51f205df4b",
  "title": "Always Looking Up: The Adventures of an Incurable Optimist",
  "pubdate": "2009-03-31 19:45:31.423469+00:00",
  "isbn": "",
  "author_name": "Michael J. Fox",
  "publisher_name": "Grand Central Publishing",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Self-Help",
    "Biography & Autobiography",
    "Biography",
    "Autobiography",
    "Biography Autobiography",
    "Entertainment Performing Arts",
    "Canada",
    "Motivational Inspirational",
    "Personal Growth - General",
    "Fox",
    "Michael J",
    "Actors - United States",
    "Entertainment Performing Arts - General",
    "Actors - Canada",
    "Individual Actors And Actresses",
    "Personal Memoirs",
    "Actors",
    "Personal Growth",
    "Biography And Autobiography",
    "Entertainment & Performing Arts",
    "Motivational & Inspirational"
  ],
  "description": "<p>At the turn from our bedroom into the hallway, there is an old, full-length mirror in a wooden frame. I can't help but catch a glimpse of myself as I pass. Turning fully toward the glass, I consider what I see. This reflected version of myself, wet, shaking, rumpled, pinched, and slightly stooped, would be alarming were it not for the self-satisfied expression pasted across my face. I would ask the obvious question, \"What are you smiling about?\" but I already know the answer: \"It just gets better from here.</p>\n\n<p>\" There are many words to describe Michael J. Fox: Actor. Husband. Father. Activist. But readers of Always Looking Up will soon add another to the list: Optimist. Michael writes about the hard-won perspective that helped him see challenges as opportunities. Instead of building walls around himself, he developed a personal policy of engagement and discovery: an emotional, psychological, intellectual, and spiritual outlook that has served him throughout his struggle with Parkinson's disease. Michael's exit from a very demanding, very public arena offered him the time--and the inspiration--to open up new doors leading to unexpected places. One door even led him to the center of his own family, the greatest destination of all. The last ten years, which is really the stuff of this book, began with such a loss: my retirement from Spin City. I found myself struggling with a strange new dynamic: the shifting of public and private personas. I had been Mike the actor, then Mike the actor with PD. Now was I just Mike with PD Parkinson's had consumed my career and, in a sense, had become my career. But where did all of this leave Me? I had to build a new life when I was already pretty happy with the old one.</p>\n\n<p>Always Looking Up shares the critical themes of Michael's life: work, politics, faith, and family. The book is a journey of self-discovery and reinvention, and a testament to the consolations that protect him from the ravages of Parkinson's. With humor and wit Michael describes how he became a happier, more satisfied person by recognizing the gifts of everyday life.</p>"
}