{
  "book_id": 1921,
  "book_uuid": "cbf7bee7-61bd-4e1d-976a-28419c85ec26",
  "title": "Ender in Exile",
  "pubdate": "2008-11-11 19:22:22.805479+00:00",
  "isbn": "",
  "author_name": "Orson Scott Card",
  "publisher_name": "Macmillan",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "Action & Adventure",
    "General",
    "Science Fiction",
    "Science Fiction - Adventure",
    "Fiction - Science Fiction",
    "Science Fiction - General",
    "American Science Fiction And Fantasy",
    "Space Opera",
    "Military",
    "Wiggin; Ender (Fictitious character)",
    "Card; Orson Scott - Prose Criticism"
  ],
  "description": "<p>After twenty-three years, Orson Scott Card returns to his acclaimed best-selling series with the first true, direct sequel to the classic Ender's Game.</p>\n\n<p>In Ender's Game, the world's most gifted children were taken from their families and sent to an elite training school. At Battle School, they learned combat, strategy, and secret intelligence to fight a dangerous war on behalf of those left on Earth. But they also learned some important and less definable lessons about life.</p>\n\n<p>After the life-changing events of those years, these children—now teenagers—must leave the school and readapt to life in the outside world.</p>\n\n<p>Having not seen their families or interacted with other people for years—where do they go now? What can they do? Ender fought for humanity, but he is now reviled as a ruthless assassin. No longer allowed to live on Earth, he enters into exile. With his sister Valentine, he chooses to leave the only home he's ever known to begin a relativistic—and revelatory—journey beyond the stars. What happened during the years between Ender's Game and Speaker for the Dead? What did Ender go through from the ages of 12 through 35? The story of those years has never been told. Taking place 3000 years before Ender finally receives his chance at redemption in Speaker for the Dead, this is the long-lost story of Ender.</p>\n\n<p>For twenty-three years, millions of readers have wondered and now they will receive the answers. Ender in Exile is Orson Scott Card's moving return to all the action and the adventure, the profound exploration of war and society, and the characters one never forgot.</p>\n\n<p>On one of these ships, there is a baby that just may share the same special gifts as Ender's old friend Bean...THE ENDER UNIVERSEEnder seriesEnder’s Game / Ender in Exile / Speaker for the Dead / Xenocide / Children of the MindEnder’s Shadow seriesEnder’s Shadow / Shadow of the Hegemon / Shadow Puppets / Shadow of the Giant / Shadows in FlightChildren of the FleetThe First Formic War (with Aaron Johnston)Earth Unaware / Earth Afire / Earth AwakensThe Second Formic War (with Aaron Johnston)The Swarm /The HiveEnder novellasA War of Gifts /First MeetingsAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>"
}