{
  "book_id": 2130,
  "book_uuid": "860716de-cbe6-42ee-a835-4fc06d437f39",
  "title": "State of Fear",
  "pubdate": "2005-08-15 05:00:00+00:00",
  "isbn": "",
  "author_name": "Michael Crichton",
  "publisher_name": "HarperCollins",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "General",
    "Thrillers",
    "Thriller",
    "Fiction - Espionage",
    "Information Technology",
    "Suspense fiction",
    "Technological",
    "Crichton",
    "Michael - Prose & Criticism",
    "Submarines (Ships)",
    "Political fiction",
    "Ecoterrorism",
    "South Pacific Ocean",
    "Newspaper editors",
    "Global warming"
  ],
  "description": "For his latest foray, Crichton alters his usual formula--three parts thrills and spills to one part hard science--to a less appetizing concoction that is half anti-global warming screed and half adventure yarn. This adds a mission impossible element to Wilson's narration: how to make pages of research interesting enough to hold the listener's attention until hero and heroine face their next peril. Unfortunately, Wilson approaches the statistical information like a newscaster communicating via Teleprompter. This earns him an A-plus for elocution and timbre, but a more average grade when it comes to dramatic interpretation. Consequently, the scientific material that Crichton spent three years researching seems even more copious in audio format than in print. And it's certainly much harder to flip past. Wilson is more successful in handling conversational passages, employing accents and adding subtle touches to various voices--a cynical tone for the hero, who's a mildly hedonistic corporate lawyer, and an edgier, less patient attitude for the beautiful, ready-for-anything heroine. As they hot-foot it around the globe, assisting an Indiana Jones-like MIT professor in thwarting evils perpetrated by a mass-murdering environmentalist, Wilson stirs up a little suspense by speaking faster and more energetically. But the book's abundance of statistics would slow any narrator's momentum, and Wilson is no exception."
}