{
  "book_id": 2711,
  "book_uuid": "11213dae-e58f-49a7-b3b4-323340022e87",
  "title": "World Without End",
  "pubdate": "2007-10-09 19:45:04.355155+00:00",
  "isbn": "",
  "author_name": "Ken Follett",
  "publisher_name": "Penguin",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "English",
    "General",
    "Suspense",
    "Romance",
    "Thrillers",
    "History",
    "Historical",
    "Historical - General",
    "England",
    "14th century",
    "Fiction - Historical",
    "Historical Fiction",
    "Great Britain",
    "Ken - Prose Criticism",
    "Great Britain - History - 14th century",
    "Black Death - England",
    "Black death",
    "Follett",
    "Sagas"
  ],
  "description": "<p>#1 New York Times BestsellerIn 1989, Ken Follett astonished the literary world with The Pillars of the Earth, a sweeping epic novel set in twelfth-century England centered on the building of a cathedral and many of the hundreds of lives it affected. World Without End is its equally irresistible sequel—set two hundred years after The Pillars of the Earth and three hundred years after the Kingsbridge prequel, The Evening and the Morning.</p>\n\n<p>World Without End takes place in the same town of Kingsbridge, two centuries after the townspeople finished building the exquisite Gothic cathedral that was at the heart of The Pillars of the Earth. The cathedral and the priory are again at the center of a web of love and hate, greed and pride, ambition and revenge, but this sequel stands on its own. This time the men and women of an extraordinary cast of characters find themselves at a crossroads of new ideas—about medicine, commerce, architecture, and justice. In a world where proponents of the old ways fiercely battle those with progressive minds, the intrigue and tension quickly reach a boiling point against the devastating backdrop of the greatest natural disaster ever to strike the human race—the Black Death. Three years in the writing and nearly eighteen years since its predecessor, World Without End is a \"well-researched, beautifully detailed portrait of the late Middle Ages\" (The Washington Post) that once again shows that Ken Follett is a masterful author writing at the top of his craft.</p>"
}