{
  "book_id": 2868,
  "book_uuid": "1cb9d649-2536-4d43-bf83-bd87f35b698a",
  "title": "The Age of Innocence",
  "pubdate": "1996-03-01 15:28:00.295704+00:00",
  "isbn": "",
  "author_name": "Edith Wharton",
  "publisher_name": "Penguin",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "General",
    "Classics",
    "Romance",
    "Literary",
    "Historical",
    "Literature: Classics",
    "Married people",
    "Criticism",
    "Literature - Classics",
    "Family Life",
    "New York (N.Y.)",
    "Triangles (Interpersonal relations)",
    "Modern contemporary fiction (post c 1945)",
    "Separated people",
    "Upper class"
  ],
  "description": "<p>Edith Wharton’s acclaimed novel of love, duty, and half-known truths in Gilded Age New York society, with a foreword by bestselling author Elif BatumanDutiful Newland Archer, an eligible young man from New York high society, is about to announce his engagement to May Welland, a suitable match from a good family, when May’s cousin, the beautiful and exotic Countess Ellen Olenska, is introduced into their circle. The Countess brings with her an aura of European sophistication and a hint of perceived scandal, having left her husband and claimed her independence. Her worldliness, disregard for society’s rules, and air of unapproachability attract the sensitive Newland, despite his enthusiasm about a marriage to May and the societal advantages it would bring. Almost against their will, Newland and Ellen develop a passionate bond, and a classic love triangle takes shape as the three young people find themselves drawn into a poignant and bitter conflict between love and duty. Written in 1920, Edith Wharton’s Pulitzer Prize-winning novel about a time and place long gone by—1870s New York City—beautifully captures the complexities of passion, independence, and fulfillment, and how painfully hard it can be for individuals to truly see one another and their place in the world.</p>\n\n<p>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.</p>"
}