{
  "book_id": 2974,
  "book_uuid": "1587d8b3-da47-4017-9043-02a62ab540b5",
  "title": "DemonWars Saga Volume 1: The Demon Awakens - the Demon Spirit - the Demon Apostle",
  "pubdate": "2014-06-24 04:00:00+00:00",
  "isbn": "",
  "author_name": "R. A. Salvatore",
  "publisher_name": "Random House Publishing Group",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "Fantasy",
    "Epic",
    "Dark Fantasy",
    "Collections & Anthologies"
  ],
  "description": "<div>\n<p>With this landmark series, bestselling author R. A. Salvatore introduced fantasy readers around the globe to an astonishing new world. As the DemonWars Saga unfolds over these first three books, two intrepid young heroes must confront the dark tides of destiny in an epic search for justice and peace. This eBook bundle includes:   THE DEMON AWAKENS THE DEMON SPIRIT THE DEMON APOSTLE   A great evil has awakened in the land of Corona: a demon determined to spread death and misery. His goblin armies and fearsome giants ravage the settlements of the frontier, and in the small village of Dundalis their merciless attack leaves behind two shattered orphans: Pony and her lifelong friend Elbryan. Taken in by elves, Elbryan is raised to become a formidable ranger—a fateful role that will lead him into harrowing confrontation.   Meanwhile, on a far-off island, a shower of gemstones falls onto the black sand shores. These heaven-sent stones carry within them an incredible power—the key to all that is good and all that is evil in the world. Now it’s up to one young monk to liberate them from the corrupt monastery that harvests them. Pray that they don’t fall into the wrong, clawed hands.   Praise for the DemonWars Saga   “An enthralling epic adventure story, it introduces memorable characters and an intricate scheme of magic the readers won’t soon forget.”—Terry Brooks, on The Demon Awakens   “A new classic! Wonderfully told! Fans will love it!”—Troy Denning, New York Times bestselling author of Star Wars: Crucible, on The Demon Awakens   “Absorbing . . . one of the finest books yet in Salvatore’s prolific career.”—Publishers Weekly, on The Demon Spirit   “Unforgettable . . . another rousing and masterful DemonWars adventure . . . a must-read for all fans of Salvatore’s work.”—Realms of Fantasy, on The Demon Apostle</p></div>"
}