{
  "book_id": 3008,
  "book_uuid": "7e0645dd-1c48-4bb0-9ad7-b31c9c10227d",
  "title": "New York: the novel",
  "pubdate": "2009-11-10 08:00:00+00:00",
  "isbn": "",
  "author_name": "Edward Rutherfurd",
  "publisher_name": "Random House, Inc.",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "English",
    "General",
    "Literary",
    "History",
    "Historical",
    "Historical - General",
    "Fiction - Historical",
    "Historical Fiction",
    "New York (N.Y.)",
    "Sagas",
    "English Historical Fiction",
    "Rutherfurd",
    "Edward - Prose & Criticism",
    "New York (N.Y.) - History"
  ],
  "description": "SUMMARY: The bestselling master of historical fiction weaves a grand, sweeping drama of New York from the city's founding to the present day.Rutherfurd celebrates America's greatest city in a rich, engrossing saga that showcases his extraordinary ability to combine impeccable historical research and storytelling flair. As in his earlier, bestselling novels, he illuminates cultural, social, and political upheavals through the lives of a remarkably diverse set of families. As he recounts the intertwining fates of characters rich and poor, black and white, native born and immigrant, Rutherfurd brings to life the momentous events that shaped New York and America: the Revolutionary War, the emergence of the city as a great trading and financial center, the excesses of the Gilded Age, the explosion of immigration in the late nineteenth and early twentieth centuries, the trials of World War II, the near-demise of New York in the 1970s and its roaring rebirth in the '90s, and the attacks on the World Trade Center. Sprinkled throughout are captivating cameo appearances by historical figures ranging from George Washington to Abraham Lincoln to Babe Ruth.New York is the book that millions of Rutherfurd's American fans have been waiting for. A brilliant mix of romance, war, family drama, and personal triumphs, it gloriously captures the search for freedom and prosperity at the heart of our nation's history."
}