{
  "book_id": 3053,
  "book_uuid": "896a008d-41cf-4d00-99b5-4a5abae15cce",
  "title": "Does the Noise in My Head Bother You?: A Rock 'N' Roll Memoir",
  "pubdate": "2011-05-03 04:00:00+00:00",
  "isbn": "",
  "author_name": "Steven Tyler",
  "publisher_name": "Harper Collins",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Biography & Autobiography",
    "Rich & Famous",
    "Composers & Musicians"
  ],
  "description": "<div>\n<p>\"I've been mythicized, Mick-icized, eulogized and fooligized, I've been Cole-Portered and farmer's-daughtered, I've been Led Zepped and 12-stepped. I'm a rhyming fool and so cool that me, Fritz the Cat, and Mohair Sam are the baddest cats that am. I have so many outrageous stories, too many, and I'm gonna tell 'em all. All the unexpurgated, brain-jangling tales of debauchery, sex &amp; drugs, transcendence &amp; chemical dependence you will ever want to hear. </p>\n<p>\" The son of a classical pianist straight out of the Bronx of old Archie comics, Steven Tyler was born to be a rock star. Weaned on Cole Porter, Nat King Cole, Mick—and his beloved Janis Joplin—Tyler began tearing up the streets and the stage as a teenager before finally meeting his \"mutant twin\" and legendary partner Joe Perry. In this addictively readable memoir, told in the playful, poetic voice that is uniquely his own, Tyler unabashedly recounts the meteoric rise, fall, and rise of Aerosmith over the last three decades and riffs on the music that gives it all meaning. Tyler tells what it's like to be a living legend and the frontman of one of the world's most revered and infamous bands—the debauchery, the money, the notoriety, the fights, the motels and hotels, the elevators, limos, buses and jets, the rehab. He reveals the spiritual side that \"gets lost behind the stereotype of the Sex Guy, the Drug Guy, the Demon of Screamin', the Terror of the Tropicana. </p>\n<p>\" And he talks about his epic romantic life and his relationship with his four children. As dazzling, bold, and out-on-the-edge as the man himself, Does the Noise in My Head Bother You? is an all-access backstage pass into this extraordinary showman's life.</p></div>"
}