{
  "book_id": 3057,
  "book_uuid": "7e22a6e6-0be2-4d94-8164-7211b0a9e524",
  "title": "Why We Suck: A Feel Good Guide to Staying Fat, Loud, Lazy and Stupid",
  "pubdate": "2008-11-04 06:00:00+00:00",
  "isbn": "",
  "author_name": "Denis Leary",
  "publisher_name": "Penguin Group",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "General",
    "Humor",
    "Topic",
    "Adult",
    "Humour",
    "Biography & Autobiography",
    "Literary Collections",
    "Essays",
    "Entertainment & Performing Arts",
    "American wit and humor",
    "Topic - Adult",
    "American Satire And Humor",
    "Humour: Collections & General"
  ],
  "description": "EDITORIAL REVIEW:\n\n**A hilarious blast of scathing irreverence from the award-winning actor and comedian**.\n\n\n\n“A pissed off Leary is the best Leary,” says one critic of the writer and comic. In *Why We Suck*, Dr. Denis Leary uses his common sense, and his biting and hilarious take on the world, to attack the politically correct, the hypocritical, the obese, the thin--basically everyone who takes themselves too seriously. He does so with the extra oomph of a doctorate bestowed upon him by his alma mater Emerson College. “Sure it’s just a celebrity type of thing--they only gave it to me because I’m famous.” Leary explains. “But it’s legal and it means I get to say I’m a doctor--just like Dr. Phil.”\n\n\n\n In *Why We Suck*, Leary’s famously smart style and sardonic wit have found their fullest and fiercest expression yet. Zeroing in on the ridiculous wherever he finds it, Leary unravels his Irish Catholic upbringing, the folly of celebrity, the pressures of family life, and the great hypocrisy of politics with the same bright, savage, and profane insight he brought to his critically acclaimed one-man shows *No Cure for Cancer* and *Lock ’n Load*, and his platinum-selling song, “Asshole.”\n\n\n\n Proudly Irish American, defiantly working class, with a reserve of compassion for the underdog and the overlooked, Leary delivers blistering diatribes that are penetrating social commentary with no holds barred. Leary’s book will find wide appeal among people who want to laugh out loud or find a guide who matches their view of what’s wrong in America and the world-at-large; and fans of his one-man shows, his many movies, and *Rescue Me*, Leary’s Golden Globe and Emmy–nominated television show. *Why We Suck* is the latest salvo from one of America’s most original and biting comic satirists."
}