{
  "book_id": 3059,
  "book_uuid": "b7234e8f-795f-413a-b232-19effed70102",
  "title": "The Black Box",
  "pubdate": "2012-11-07 05:00:00+00:00",
  "isbn": "",
  "author_name": "Michael Connelly",
  "publisher_name": "Little Brown",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Suspense",
    "Mystery",
    "Azizex666"
  ],
  "description": "<div><p>In a case that spans 20 years, Harry Bosch links the bullet from a recent crime to a file from 1992, the killing of a young female photographer during the L.A. riots. Harry originally investigated the murder, but it was then handed off to the Riot Crimes Task Force and never solved.<br></p><p>Now Bosch's ballistics match indicates that her death was not random violence, but something more personal, and connected to a deeper intrigue. Like an investigator combing through the wreckage after a plane crash, Bosch searches for the \"black box,\" the one piece of evidence that will pull the case together.<br></p><p>Riveting and relentlessly paced, THE BLACK BOX leads Harry Bosch, \"one of the greats of crime fiction\" (<em>New York Daily News</em>), into one of his most fraught and perilous cases.</p><h3>From Booklist</h3><p><em>Starred Review</em> At his core, Harry Bosch is a cop with a mission—to tip the scales of justice toward the side of murder victims and their survivors. The scales can never be righted, of course, even by solving the cases Bosch is assigned in the Open Unsolved Unit of the LAPD. That is especially true in the 20-year-old murder of Danish journalist Anneke Jesperson, who was killed during the L.A. riots of 1992. What was Jesperson, a white woman, doing in South Central L.A. in the aftermath of the riots? As usual, Bosch faces not only the seeming impossibility of reconstructing a crime that has been cold for two decades but also the roadblocks imposed by the bureaucrats at the top of the LAPD. But Bosch has never met a roadblock he wasn’t compelled to either barge through or cannily avoid. Harry is such a compelling character largely due to his fundamentally antiestablishment personality, which leads to chaos as often as to triumph, but also because his unswerving work ethic reflects not simply duty but also respect for the task before him. Harry does it right, even—or especially—when his bosses want something else entirely. That’s the case this time—How would it look if a white cop made headlines by solving the riot-related murder of a white woman? Better to let it slide. In real life, we all let things slide, but in life according to Bosch, nothing slides. We like Harry, as we like many other fictional crime solvers, because he never stops, but we love him because he has the scars to prove that never sliding is no easy thing. HIGH-DEMAND BACKSTORY: Connelly’s twenty-fifth book appears in his twentieth year of publishing, an anniversary that his publisher has been celebrating throughout 2012 with various “Year of Connelly” promotions, all leading up to the publication of The Black Box. --Bill Ott </p><h3>Review</h3><p>PRAISE FOR <em>THE DROP</em>:<br></p><p>\"Connelly inherits the mantle of Raymond Chandler.... Their books share a kind of ambitious artistry that strains to reach beyond genre fiction.\" (<strong><em>Boston Globe</em></strong> <strong><em>Chuck Leddy</em></strong> )<br></p><p>\"Connelly is superb at building suspense.\" (<strong><em>Wall Street Journal</em></strong> <strong><em>Tom Nolan</em></strong> )<br></p><p>\"Bosch is one of the best detectives in crime fiction, and Connelly continues to amaze with his latest effort.\" (<strong><em>Associated Press</em></strong> <strong><em>Jeff Ayers</em></strong> )<br></p><p>\"Starts with a bang and stays strong all the way through.\" (<strong><em>New York Times</em></strong> <strong><em>Janet Maslin</em></strong> )<br></p><p>\"Connelly's lean, just-the-facts style makes for crisp dialogue and a brisk, info-driven plot....A haunted quality has always been one of the chief attractions of Connelly's series and of Bosch's character.\" (<strong><em>Washington Post</em></strong> <strong><em>Art Taylor</em></strong> ) </p></div>"
}