{
  "book_id": 3061,
  "book_uuid": "0d985fea-2044-41de-bb7a-13af791d9af6",
  "title": "Colonel Roosevelt",
  "pubdate": "2010-11-23 10:00:00+00:00",
  "isbn": "",
  "author_name": "Edmund Morris",
  "publisher_name": "Random House, Inc.",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "General",
    "History",
    "United States",
    "Biography & Autobiography",
    "20th Century",
    "Biography",
    "Presidents",
    "Presidents & Heads of State",
    "Presidents - United States",
    "Roosevelt",
    "Theodore",
    "United States - Politics and government - 1909-1913",
    "United States - Politics and government - 1913-1921"
  ],
  "description": "<div><h3>From</h3><p><em>Starred Review</em> Morris completes his fully detailed, correlatively dynamic triptych of the restless, energetic, on-the-move first President Roosevelt, following The Rise of Theodore Roosevelt (1979), the title self-explanatory in terms of its coverage of TR’s life, and Theodore Rex (2001), about his presidency. Now the author presents Colonel Roosevelt, the title by which Roosevelt chose to be called during his postpresidential years (in reference, of course, to his military position during the Spanish-American War). This is the sad part of TR’s life; this is the stage of his life story in which it is most difficult to accept his self-absorption, self-importance, and self-righteousness, but it is the talent of the author, who has shown an immaculate understanding of his subject, to make Roosevelt of continued fascination to his readers. In essence, this volume tells the story of TR’s path of disenchantment with his chosen successor in the White House, William Taft, and his attempt to resecure the presidency for himself. The important theme of TR’s concomitant decline in health is also a part of the narrative. We are made aware most of all that of all retired presidents, TR was the least likely to fade into the background. --Brad Hooper </p><h3>Review</h3><p><strong>_Praise for <em>Colonel Roosevelt</em>_</strong> </p><p>\"Now with <em>Colonel Roosevelt</em>, the magnum opus is complete. And it deserves to stand as the definitive study of its restless, mutable, ever-boyish, erudite and tirelessly energetic subject. Mr. Morris has addressed the toughest and most frustrating part of Roosevelt’s life with the same care and precision that he brought to the two earlier installments. And if this story of a lifetime is his own life’s work, he has reason to be immensely proud.\" –Janet Maslin, _The New York Times </p><p><em>\"Exemplary… Consistently rich and on point, with rapidly developing events providing a backdrop for the balanced examination [Morris] presents of his subject…The TR trilogy is masterful, and can rightfully take its place among the truly outstanding biographies of the American presidency.\" –</em>LA Times<br>_<br>\"Reading Edmund Morris on Teddy Roosevelt is like listening to Yo-Yo Ma play Bach: You know from the first note you’re in inspired hands. In <em>Colonel Roosevelt</em>—the final installment in a trilogy that began with <em>The Rise of Theodore Roosevelt</em> and <em>Theodore Rex</em>—Morris registers the Bull Moose’s last decade in handsome, sweeping prose that avoids the valedictory chord struck by biographers who, nearing the end of their prodigious labors, resort to swooning across the chapters, unwilling to let go of their muse.\" _– The Washingtonian </p><p>\"Colonel Roosevelt_, the third part of his three-volume biography of Roosevelt, is a worthy and extremely engaging culmination of Mr. Morris' work. It is popular history at its best.\" –Claude R. Marx, _The Washington Times<br>_ </p><p><strong><em>Praise for the classic biographies by Edmond Morris</em></strong> </p><p><em></em><em>The Rise of Theodore Roosevelt</em><br>Winner of the Pulitzer Prize<em></em> </p><p>“One of those rare works that is both definitive for the period it covers and fascinating to read for sheer entertainment.”_—The New York Times Book Review_ </p><p>“A towering biography.”_—Time_ </p><p><em></em><em>Theodore Rex</em><br>Winner of the <em>Los Angeles Times</em> Book Prize for Biography<em></em> </p><p>“A masterpiece . . . A great president has finally found a great biographer.”_—The Washington Post_ </p><p>“As a literary work on Theodore Roosevelt, it is unlikely ever to be surpassed. It is one of the great histories of the American presidency, worthy of being on a shelf alongside Henry Adams’s volumes on Jefferson and Madison.”_—Times Literary Supplement_ </p><p><em>“Magnificent . . .  a compulsively readable, beautifully measured and paced account.”—Chicago Tribune</em></p> </div>"
}