{
  "book_id": 3068,
  "book_uuid": "78c7de56-61c3-4b76-8180-e4acc59a101d",
  "title": "Night Fall",
  "pubdate": "2004-11-24 10:00:00+00:00",
  "isbn": "",
  "author_name": "Nelson DeMille",
  "publisher_name": "Akasha Multimedia",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "General",
    "Mystery & Detective",
    "Suspense",
    "Police Procedural",
    "Thrillers",
    "Terrorism",
    "Suspense fiction",
    "Large type books",
    "Aircraft accidents",
    "Aircraft accidents - Investigation",
    "Government investigators",
    "John (Fictitious character)",
    "Corey",
    "Investigation",
    "Long Island (N.Y.)",
    "John (Fictious character)",
    "TWA Flight 800 Crash",
    "1996"
  ],
  "description": "<div><h3>Amazon.com Review</h3><p>John Corey, former NYPD homicide detective, assigned to the Federal Anti-Terrorist Task Force in the pre-millennium 90's, makes a return appearance in a thoughtful novel offering an alternative to the government's \"official\" position on what really happened to TWA Flight 800, which crashed off the Long Island coast in the summer of 1996. Accompanying his wife Kate to a memorial marking the five-year anniversary of the crash, Corey's curiosity is aroused by what appears to be a concerted effort by Kate's fellow federal agents to keep him--and her--from investigating a case that appears to be closed. Corey's detecting skills lead him to two witnesses to the crash, who were enjoying an adulterous interlude on the beach at the time the plane went down--and videotaping their sexual escapades while what appears to be a terrorist missile attack takes place in the background. What ratchets up the tension in this capably written thriller is what the reader knows but Corey doesn't as he heads for a showdown with those responsible for the official cover-up as the clock ticks down to the morning of September 11, 2001. DeMille's deft touch with a riddle wrapped in an enigma--what really happened to Flight 800--makes his \"what if\" scenario a more than plausible theory; you don't have to believe in conspiracies or government cover-ups to find his latest engrossing, entertaining, and enlightening. <em>--Jane Adams</em></p><p><strong>Amazon.com Exclusive Content</strong></p><p><strong>Nelson DeMille on <em>Night Fall</em>: An Exclusive Essay</strong> </p><p><em>Night Fall</em>. Read this Amazon.com </p><h3>From Publishers Weekly</h3><p>Demille's latest is sure to be a #1 bestseller—but it's also sure to be controversial. The book is centered on an investigation of the July 1996 crash of flight TWA 800, \"when... a big Boeing 747 bound for Paris with 230 passengers and crew on board, exploded off the Atlantic coast of Long Island, sending all 230 souls to their deaths.\" In July 2001, Federal Anti-Terrorist Task Force detective John Corey, a brilliant, smart-ass detective last seen in <em>Plum Island </em>and <em>The Lion's Game</em>, accompanies his FBI agent wife, Kate Mayfield, to the fifth anniversary of the disaster. John, whose wife worked the crash in 1996, understands that Kate has brought him along because she doesn't buy the official finding of \"mechanical failure\" and wants him to mount his own investigation. There are 200 eyewitnesses who swear they saw a missile lift into the clear night sky and bring down the airplane, a charge dismissed by the CIA as an optical illusion. Though Corey is warned away from the investigation, like any good fictional detective, this only serves to spur him on. He uncovers evidence that a man and a woman, on the beach that fateful night videotaping their adulterous affair, inadvertently caught on tape the missile hitting the plane. The book is primarily about John tracking down the couple, but as the end nears, readers will begin to understand the perilous direction in which Demille is leading them. The pages will turn in a blur as a feeling of dread grows, until the end comes and one's worst fears are confirmed. Readers will think about this one for a long time. <br>Copyright © Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. </p> </div>"
}