{
  "book_id": 3070,
  "book_uuid": "3071201d-7c65-4cf5-8c26-07b7da8c472d",
  "title": "Silver on the Tree (Dark 5)",
  "pubdate": "2007-05-07 14:00:00+00:00",
  "isbn": "",
  "author_name": "Susan Cooper",
  "publisher_name": "Simon Pulse",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "Juvenile Fiction",
    "Action & Adventure",
    "General",
    "Classics",
    "Science Fiction",
    "Fantasy",
    "Fantasy fiction",
    "Philosophy",
    "Space and time",
    "Fantasy & Magic",
    "Europe",
    "People & Places",
    "Good and evil",
    "Fables",
    "Legends",
    "Myths",
    "Metaphysics",
    "Good & Evil",
    "Stanton",
    "Will (Fictitious character)",
    "Metaphorical tales",
    "Wales",
    "Arthurian"
  ],
  "description": "<div> <h3>Review</h3> <div> Psychology Today \"Susan Cooper is one of the few contemporary writers who has the vivid imagination, the narrative powers, and the moral vision that permit her to create the kind of sweeping conflict between good and evil that lies at the heart of all great fantasy. Tolkien had it. So did C.S. Lewis. And Cooper writes in the same tradition.\" </div> <h3>Product Description</h3> <div> <i></i><p align=\"center\"> \"And Where the Midsummer Tree Grows Tall by Pendragon's Sword the Dark Shall Fall.\" </p><p> The Dark is rising in its last and greatest bid to control the world. Six individuals have come together to drive it back for good: Will, the Sign seeker; Bran, the raven boy; Jane, Simon, and Barney, the grail seekers; and Merriman, the wise mentor who unites them all. Together they stand ready to face the Rider and the full force of the Dark. </p><p> But the last object of power must first be found. A sword of legend magically forged of pure crystal remains hidden in the Welsh hills. Without it, the Light has no hope against the Dark. Will and his companions must travel through time and space in an epic clash of magical powers that will decide the fate of us all. </p></div> </div>"
}