{
  "book_id": 3086,
  "book_uuid": "33d2be52-dbcd-43b2-9958-84b22d75a677",
  "title": "Don DeLillo: Mao II & Underworld (LOA #374)",
  "pubdate": "2023-10-17 19:34:52.956679+00:00",
  "isbn": "",
  "author_name": "Don DeLillo",
  "publisher_name": "Library of America",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "American",
    "20th Century",
    "Historical",
    "Satire",
    "prose_contemporary",
    "World Literature",
    "Post-World War II"
  ],
  "description": "<p>The definitive edition of a modern master continues with 2 mid-career masterpieces, published here with new prefaces from the authorThis second volume in the Library of America DeLillo edition collects two extraordinary novels he published in the 1990s, the peak of his career.</p>\n\n<p>In the PEN/Faulkner Award–winning Mao II (1991), the celebrated novelist Bill Gray has withdrawn into seclusion, his everyday affairs managed by a pair of assistants. And yet within the protective solitude he has built for himself he still finds himself struggling—with pills and with a novel he can’t manage to complete. A visit from a Swedish photographer who specializes in author portraits spurs him to shake off his world-weariness, and soon the reclusive writer is embarked on an unlikely journey to help broker the release of a poet held hostage by terrorists in Beirut. Mao II, writes the critic Sven Birkerts, is “DeLillo’s strongest statement yet about the crisis of crises. Namely, that we are living in the last violet twilight of the individual, and that ‘the future belongs to crowds.’”Underworld (1997), DeLillo’s magnum opus and a book that ranks among the greatest of twentieth-century novels, is a sprawling, ambitious, and moving panorama of the postwar American experience. It begins with a tour de force re-imagination of one of the great moments in sports: the decisive pennant game between the New York Giants and the Brooklyn Dodgers at the Polo Grounds in 1951, culminating in the now legendary “shot heard ’round the world” home run by Bobby Thomson. In DeLillo’s hands the excitement of the game is juxtaposed with something far more momentous, the announcement of the Soviets’ first atomic test—a coincidence that initiates a kaleidoscopic saga that is woven across more than four decades, shuttling back and forth through time and mixing fictional characters with historical figures such as Lenny Bruce and J. Edgar Hoover. The novel is at once a profound meditation on our contemporary condition and a deeply personal book for its author, drawing poignantly on his memories of growing up in the Bronx. “All of DeLillo is in Underworld,” writes Harold Bloom. “DeLillo’s sense of America, in the second half of the twentieth century, is achieved perfectly.”Here is the ultimate gift for DeLillo fans and perfect introduction for readers interested in discovering or rediscovering a great American writer.</p>"
}