{
  "book_id": 3098,
  "book_uuid": "14e346f0-cd0f-4adf-adf4-08657441d052",
  "title": "Vernon God Little",
  "pubdate": "2002-12-31 23:00:00+00:00",
  "isbn": "",
  "author_name": "DBC Pierre",
  "publisher_name": "Harvest Books",
  "series_name": "",
  "series_index": 1.0,
  "tags": [],
  "description": "<div><h3>Amazon.com Review</h3><p>The surprise winner of the 2003 Man Booker Prize, DBC Pierre's debut novel, <em>Vernon God Little</em>, makes few apologies in its darkly comedic portrait of Martirio, Texas, a town reeling in the aftermath of a horrific school shooting. Fifteen-year-old Vernon Little narrates the first-person story with a cynical twang and a four-letter barb for each of his diet-obsessed townsfolk. His mother, endlessly awaiting the delivery of a new refrigerator, seems to exist only to twist an emotional knife in his back; her friend, Palmyra, structures her life around the next meal at the Bar-B-Chew Barn; officer Vaine Gurie has Vernon convicted of the crime before she's begun the investigation; reporter Eulalio Ledesma hovers between a comforting father-figure and a sadistic Bond villain; and Jesus, his best friend in the world, is dead--a victim of the killings. As his life explodes before him, Vernon flees his home in pursuit of a tropical fantasy: a cabin on a beach in Mexico he once saw in the movie <em>Against All Odds</em>. But the police--and TV crews--are in hot pursuit. </p><p><em>Vernon God Little</em> is a daring novel and demands a patient reader, not because it is challenging to read--Pierre's prose flows effortlessly, only occasionally slipping from the unmistakable voice of his hero--but because the book skates so precariously between the almost taboo subject of school violence and the literary gamesmanship of postmodern fiction. Yet, as the novel unfolds, Pierre's parodic version of American culture never crosses the line into caricature, even when it climaxes in a death-row reality TV show. And Vernon, whose cynicism and smart-ass \"learnings\" give way to a poignant curiosity about the meaning of life, becomes a fully human, profoundly sympathetic character. <em>--Patrick O'Kelley</em></p><h3>From Publishers Weekly</h3><p>Pierre takes a freewheeling, irreverent look at teenage Sturm und Drang in his erratic, sometimes darkly comic debut novel about a Texas boy running from the law in the wake of a gory school shooting. Vernon Gregory Little is the 15-year-old protagonist, a nasty, sarcastic teenager accused of being an accessory to the murders committed by his friend Jesus Navarro in tiny Martirio, \"the barbecue sauce capital of Texas.\" Vernon manages to make bail and avoid the media horde that descends on the town after the killings, but he's unable to get to the other gun-his father's-which he knows will tie him to the crime, despite his innocence. His flight path takes him first to Houston, where he unsuccessfully tries to hook up with gorgeous former schoolmate Taylor Figueroa; the crafty beauty, promised a media job by the evil Lally, who's also duped Vernon's mom, follows him to Mexico and efficiently betrays him. Most of the plotting feels like an excuse for Vernon's endless, sharply snide riffs on his small town and the unique excesses of America that helped spawn the killings. Unfortunately, Vernon's voice grows tiresome, his excesses make him rather unlikable and the over-the-top, gross-out humor is hit-or-miss. Pierre's wild energy offers entertaining satire as well as cringe-provoking scenes, and though he can write with incisive wit, this is a bumpy ride. <br>Copyright 2003 Reed Business Information, Inc. </p> </div>"
}