{
  "book_id": 3140,
  "book_uuid": "ff53bf0d-5e5a-433d-a08b-5ba84765a374",
  "title": "The Fault in Our Stars",
  "pubdate": "2012-01-09 17:00:00+00:00",
  "isbn": "",
  "author_name": "John Green",
  "publisher_name": "Dutton Juvenile",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Juvenile Fiction",
    "Social Issues",
    "Death & Dying"
  ],
  "description": "<div><h3>Amazon.com Review</h3><p><strong>Amazon Best Books of the Month, January 2012</strong>: In <em>The Fault in Our Stars</em>, John Green has created a soulful novel that tackles big subjects--life, death, love--with the perfect blend of levity and heart-swelling emotion. Hazel is sixteen, with terminal cancer, when she meets Augustus at her kids-with-cancer support group. The two are kindred spirits, sharing an irreverent sense of humor and immense charm, and watching them fall in love even as they face universal questions of the human condition--How will I be remembered? Does my life, and will my death, have meaning?--has a raw honesty that is deeply moving. <em>--Seira Wilson</em></p><h3>Review</h3><p>“An electric portrait of young people who learn to live life with one foot in the grave. Filled with staccato bursts of humor and tragedy, <em>The Fault in Our Stars</em> takes a spin on universal themes--Will I be loved? Will I be remembered? Will I leave a mark on this world?--by dramatically raising the stakes for the characters who are asking.” <br>--Jodi Picoult, author of <em>My Sister’s Keeper</em> and <em>Sing You Home</em></p><p>\"A novel of life and death and the people caught in between, <em>The Fault in Our Stars</em> is John Green at his best. You laugh, you cry, and then you come back for more.\" -- Markus Zusak, bestselling and Printz Honor­ winning author of <em>The Book Thief</em></p><p>\"John Green writes incredible, honest truths about the secret, weird hearts of human beings. He makes me laugh and gasp at the beauty of a sentence or the twist of a tale. He is one of the best writers alive and I am seething with envy of his talent.\" --E. Lockhart, National Book Award Finalist and Printz Honor­winning author of <em>The Disreputable History of Frankie Landau Banks</em> and <em>The Boyfriend List</em></p></div>"
}