{
  "book_id": 3173,
  "book_uuid": "0b744cd2-ce7d-4053-9564-5cf41953be23",
  "title": "Netherland",
  "pubdate": "2008-03-14 10:00:00+00:00",
  "isbn": "",
  "author_name": "Joseph O'Neill",
  "publisher_name": "Pantheon Books",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "General",
    "Literary",
    "Psychological",
    "Sports",
    "New York (N.Y.)",
    "Immigrants"
  ],
  "description": "<div><h3>Amazon.com Review</h3><p><strong>Amazon Exclusive: A Q&amp;A with Joseph O'Neill</strong> </p><p><strong>Joseph O’Neill was born in Ireland and raised in Holland. He received a law degree from Cambridge University and worked as a barrister in London. He writes regularly for <em>The Atlantic Monthly</em> and is the author of two previous novels, <em>New York Times</em> Notable Book. O'Neill received the 2009 PEN/Faulkner Award for Fiction for his third novel, <em>Netherland</em>. He lives with his family in New York City.</strong></p><p><strong>Question:</strong> President Obama mentioned in a <em>New York Times Magazine</em> profile that he’s reading <em>Netherland</em>. How do you feel about the President reading your book?</p><p><strong>Joseph O'Neill:</strong> I'm very honored, of course.</p><p><strong>Question:</strong> How is the world of <em>Netherland</em> particular to the United States after 9/11? </p><p><strong>Joseph O'Neill:</strong> The story takes place in the aftermath of 9/11. One of the things it does is try to evoke the disorientation and darkness of that time, which we only emerged from with the election of President Obama.</p><p><strong>Question:</strong> What is the importance of the sport of cricket in this book? Do you play? </p><p><strong>Joseph O'Neill:</strong> I love sport and play cricket and golf myself. Sport is a wonderful way to bring together people who would otherwise have no connection to each other.</p><p><strong>Question:</strong> One of your reviewers calls <em>Netherland</em> an answer to </p><p><strong>Joseph O'Neill:</strong> Halfway through the book I realized with a slightly sinking feeling that the plot of <em>Netherland</em> was eerily reminiscent of the <em>Gatsby</em> plot: dreamer drowns, bystander remembers. But there are only about 5 plots in existence, so I didn't let it bother me too much. Fitzgerald thankfully steered clear of cricket.</p><p><strong>Question:</strong> Many reviewers have commented on the “voice” of this novel. How it is more a novel of voice than of plot? Do you agree with this? </p><p><strong>Joseph O'Neill:</strong> Yes, I would agree with that comment. This is not a novel of eventful twists and turns. It is more like a long-form international cricket match (which can last for 5 days without a winner emerging), about nuance and ambiguity and small slippages of insight. And about language, of course. </p><p>(Photo © Lisa Acherman) </p><h3>From Publishers Weekly</h3><p>Starred Review. Hans van den Broek, the Dutch-born narrator of O'Neill's dense, intelligent novel, observes of his friend, Chuck Ramkissoon, a self-mythologizing entrepreneur-gangster, that he never quite believed that people would sooner not have their understanding of the world blown up, even by Chuck Ramkissoon. The image of one's understanding of the world being blown up is poignant—this is Hans's fate after 9/11. He and wife Rachel abandon their downtown loft, and, soon, Rachel leaves him behind at their temporary residence, the Chelsea Hotel, taking their son, Jake, back to London. Hans, an equities analyst, is at loose ends without Rachel, and in the two years he remains Rachel-less in New York City, he gets swept up by Chuck, a Trinidadian expatriate Hans meets at a cricket match. Chuck's dream is to build a cricket stadium in Brooklyn; in the meantime, he operates as a factotum for a Russian gangster. The unlikely (and doomed from the novel's outset) friendship rises and falls in tandem with Hans's marriage, which falls and then, gradually, rises again. O'Neill (_This Is the Life_) offers an outsider's view of New York bursting with wisdom, authenticity and a sobering jolt of realism. <em>(May)</em> <br>Copyright © Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. </p> </div>"
}