{
  "book_id": 3190,
  "book_uuid": "01a92995-2e79-40b2-acb3-ff7f2b71030a",
  "title": "The Light Between Oceans",
  "pubdate": "2012-01-01 06:00:00+00:00",
  "isbn": "",
  "author_name": "M. L. Stedman",
  "publisher_name": "Scribner",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Adult",
    "Historical"
  ],
  "description": "<div><p><strong>The debut of a stunning new voice in fiction— a novel both heartbreaking and transcendent </strong></p><p>After four harrowing years on the Western Front, Tom Sherbourne returns to Australia and takes a job as the lighthouse keeper on Janus Rock, nearly half a day’s journey from the coast. To this isolated island, where the supply boat comes once a season and shore leaves are granted every other year at best, Tom brings a young, bold, and loving wife, Isabel. Years later, after two miscarriages and one stillbirth, the grieving Isabel hears a baby’s cries on the wind. A boat has washed up onshore carrying a dead man and a living baby. </p><p>Tom, whose records as a lighthouse keeper are meticulous and whose moral principles have withstood a horrific war, wants to report the man and infant immediately. But Isabel has taken the tiny baby to her breast. Against Tom’s judgment, they claim her as their own and name her Lucy. When she is two, Tom and Isabel return to the mainland and are reminded that there are other people in the world. Their choice has devastated one of them. </p><p>M. L. Stedman’s mesmerizing, beautifully written novel seduces us into accommodating Isabel’s decision to keep this “gift from God.” And we are swept into a story about extraordinarily compelling characters seeking to find their North Star in a world where there is no right answer, where justice for one person is another’s tragic loss. </p><p><em>The Light Between Oceans </em>is exquisite and unforgettable, a deeply moving novel.</p><h3>Amazon.com Review</h3><p><strong>Amazon Best Books of the Month, August 2012</strong>: Tom Sherbourne is a lighthouse keeper on Janus Rock, a tiny island a half day’s boat journey from the coast of Western Australia. When a baby washes up in a rowboat, he and his young wife Isabel decide to raise the child as their own. The baby seems like a gift from God, and the couple’s reasoning for keeping her seduces the reader into entering the waters of treacherous morality even as Tom--whose moral code withstood the horrors of World War I--begins to waver. M. L. Stedman’s vivid characters and gorgeous descriptions of the solitude of Janus Rock and of the unpredictable Australian frontier create a perfect backdrop for the tale of longing, loss, and the overwhelming love for a child that is <em>The Light Between Oceans</em>. --<em>Malissa Kent</em></p><h3>Review</h3><p>“An extraordinary and heart-rending book about good people, tragic decisions and the beauty found in each of them.”<strong>—Markus Zusak, author of *The Book Thief</strong>*<br></p><p>“M.L. Stedman’s <em>The Light Between Oceans </em>is a beautiful novel about isolation and courage in the face of enormous loss. It gets into your heart stealthily, until you stop hoping the characters will make different choices and find you can only watch, transfixed, as every conceivable choice becomes an impossible one. I couldn’t look away from the page and then I couldn’t see it, through tears. It’s a stunning debut.”<strong>—Maile Meloy, author of *Both Ways Is the Only Way I Want It</strong><em>*<br></em></p><p><em>“M.L. Stedman, a spectacularly sure storyteller, swept me to a remote island nearly a century ago, where a lighthouse keeper and his wife make a choice that shatters many lives, including their own. This is a novel in which justice for one character means another’s tragic loss, and we care desperately for both. Reading <em>The Light Between Oceans</em> is a total-immersion experience, extraordinarily moving.”<strong>—Monica Ali, author of <em>Brick Lane </em>and* Untold Story</strong>*<br></em></p><p><em>\"Irresistible...seductive...a high concept plot that keeps you riveted from the first page.\"<strong>—Sara Nelson, <em>O</em>, the Oprah magazine</strong><br></em></p><p><em>“Haunting...Stedman draws the reader into her emotionally complex story right from the beginning, with lush descriptions of this savage<strong> </strong>and beautiful landscape, and vivid characters with whom we can readily empathize. Hers is a stunning and memorable debut.”<strong>—<em>Booklist</em>, starred review</strong><em><br></em></em></p><p><em><em>“[Stedman sets] the stage beautifully to allow for a heart-wrenching moral dilemma to play out... Most impressive is the subtle yet profound maturation of Isabel and Tom as characters.”<strong>—<em>Publishers Weekly</em>, starred review</strong><br></em></em></p><p><em><em>“The miraculous arrival of a child in the life of a barren couple delivers profound love but also the seeds of destruction. Moral dilemmas don’t come more exquisite than the one around which Australian novelist Stedman constructs her debut.”<strong>—<em>Kirkus Reviews</em>, starred review</strong><br></em></em></p><p><em><em>“This heartbreaking debut from M L Stedman is a gem of a book that you'll have trouble putting down”<strong>—*Good Housekeeping</strong>*<br></em></em></p><p><em><em>“This fine, suspenseful debut explores desperation, morality, and loss, and considers the damaging ways in which we store our private sorrows, and the consequences of such terrible secrets.”<strong>—*Martha Stewart Whole Living</strong>*<br></em></em></p><p><em><em>“As time passes the harder the decision becomes to undo and the more towering is its impact. This is the story of its terrible consequences. But it is also a description of the extraordinary, sustaining power of a marriage to bind two people together in love, through the most emotionally harrowing circumstances.”<strong>—Victoria Moore, *The Daily Mail</strong>*</em></em></p></div>"
}