{
  "book_id": 3222,
  "book_uuid": "df5504e2-66d8-4c73-a451-a0b2eb77bac8",
  "title": "Argo: How the CIA and Hollywood Pulled Off the Most Audacious Rescue in History",
  "pubdate": "2012-09-13 07:00:00+00:00",
  "isbn": "",
  "author_name": "Antonio Mendez",
  "publisher_name": "Penguin",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "History",
    "United States",
    "20th Century"
  ],
  "description": "<div><p><strong>The true account of the 1979 rescue of six American hostages from Iran</strong><br></p><p>On November 4, 1979, Iranian militants stormed the American embassy in Tehran and captured dozens of American hostages, sparking a 444-day ordeal and a quake in global politics still reverberating today. But there is a little-known drama connected to the crisis: six Americans escaped. And a top-level CIA officer named Antonio Mendez devised an ingenious yet incredibly risky plan to rescue them before they were detected.<br></p><p>Disguising himself as a Hollywood producer, and supported by a cast of expert forgers, deep cover CIA operatives, foreign agents, and Hollywood special effects artists, Mendez traveled to Tehran under the guise of scouting locations for a fake science fiction film called <em>Argo</em>. While pretending to find the perfect film backdrops, Mendez and a colleague succeeded in contacting the escapees, and smuggling them out of Iran.<br></p><p>Antonio Mendez finally details the extraordinarily complex and dangerous operation he led more than three decades ago. A riveting story of secret identities and international intrigue, Argo is the gripping account of the history-making collusion between Hollywood and high-stakes espionage. <br></p><h3>Review</h3><p>“This is an amazing and dramatic story of intrigue and deception set against the backdrop of</p><p>international tension.”<br>—<em>Booklist <br></em></p><p>“Fresh and engaging…A solid choice for fans of thrillers and international intrigue.”  <br>—<em>Kirkus <br></em></p><p>“[A] fast-paced account of a 1979 rescue operation during the Iran hostage crisis of 1979–1981…</p><p>Details of this dangerous operation inject strong suspense and excitement into the closing chapters.”  <br>—<em>Publishers Weekly<br></em></p><p>“One of the most daring and courageous clandestine operations during my career involved efforts to rescue Americans taken hostage in Tehran after our embassy was seized on November 4, 1979. Six Americans managed to escape the U.S. compound and flee to the Canadian embassy, where they were hidden. A very brave CIA officer, Tony Mendez, using commercial cover, entered Iran with false identities for the six and, using techniques that ought to remain secret so they can be used again, managed to get them out of Iran.”  <br>—Robert M. Gates, former Director of the Central Intelligence Agency and former U.S. Secretary of Defense, in his book <em>From the Shadows<br></em></p><p>“This is a fascinating story about how Tony Mendez and the CIA used a bit of technical expertise and a lot of daring and courage to rescue American hostages in Iran. Tony is emblematic of the extraordinary men and women of CIA. Most of their stories cannot be told—but fortunately, in ARGO, Tony has been able to lift the veil of secrecy—just a bit.” </p><p>—George J. Tenet, former director of Central Intelligence Agency<br></p><p>“James Bond’s Q comes to life. This gripping, true story of a white-knuckle operation by a little known part of the CIA reads like a thriller. Full of authentic detail and characters, of bravery and drama, it’s a must-read for all spy enthusiasts and CIA watchers.”  </p><p>—Dame Stella Rimington, former general director, MI5, British Intelligence<br></p><p>“The CIA and Hollywood in cahoots, a painter turned spy, an impossible rescue mission with no guns and only one chance at success—ARGO has everything. This remarkable white-knuckle spy story is torn from the pages of real life, and will have you up past your bedtime to discover its thrilling endgame.”  <br>—Eric Blehm, author of <em>Fearless<br></em></p><p>“Forget your spy novels, here’s how this stuff really works: Two secret agents quietly enter the enemy camp, unarmed but for their wit and experience. Hiding in plain sight, they rescue six virtual hostages under the eyes of their captors, a covert operation seemingly devised in Central Casting. Now their story can be told – and it makes for one hell of read.”   </p><p>—Peter Earnest, retired CIA officer and Executive Director, International Spy Museum<br></p><p>“This true spy story has it all: guile, audacity, and bravery in a struggle with a fanatic and lethal enemy, a crucial role played by a loyal ally, and a marvelous conspiracy with Hollywood.”</p><p>—R. James Woolsey, former director of the Central Intelligence Agency<br></p><p>“Artist-spy Tony Mendez paints a dramatic portrait of unlikely collaborators—Hollywood, the CIA and Canada—allied in the common cause of freedom. Mendez fills Argo with the drama, pressure and tension of one of CIA’s most spectacular rescue operations. ARGO is proof that espionage reality is more riveting than spy fiction.”  <br>—Robert Wallace, former director, CIA Office of Technical Service<br></p><p>“Tony Mendez is a spy’s spy. His work saved my neck on numerous occasions. I laugh quietly to myself when I watch Hollywood’s version of disguise technology in today’s spy movies—because Tony did it better. What he did in the Argo operation was spine-tingling espionage at its very best.”  <br>—James M. Olson, former director of CIA Counterintelligence <br></p><p>“ARGO is a must-read to understand how dangerous risks have been successfully managed by men and women like Tony Mendez operating in secrecy for our protection.”</p><p>—William H. Webster, former director, Central Intelligence and Federal Bureau of Investigation</p><h3>About the Author</h3><p>Antonio Mendez served in the CIA for twenty-five years and is a highly decorated CIA officer, one of the top 50 officers in its first 50 years and a recipient of the Intelligence Star for Valor for the ARGO operation. The author of <em>The Master of Disguise </em>and<em> Spy Dust, </em>Mendez lives with his family in rural Washington County, Maryland.<br></p><p>Matt Baglio has worked for a variety of news organizations and magazines. Author ofthe bestselling <em>The Rite: The Making of a Modern Exorcist</em>, he divides his time between California and Italy.</p></div>"
}