{
  "book_id": 3254,
  "book_uuid": "26f46956-8a80-490d-add7-53676ad7b882",
  "title": "U.S.A.: The Complete Trilogy [The 42nd Parallel, 1919, and the Big Money]",
  "pubdate": "2024-02-27 20:33:17.078733+00:00",
  "isbn": "",
  "author_name": "John Dos Passos",
  "publisher_name": "HarperCollins",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "Classics",
    "Political",
    "Literary",
    "20th Century",
    "Historical",
    "World War I"
  ],
  "description": "<p>This gorgeous new paperback edition collects the three volumes of John Dos Passos’s acclaimed U.S.A. trilogy, named one of the best books of the twentieth century by the Modern Library, and a “linguistically adventurous national portrait for a precarious age—his, and ours” (The New Yorker). The U.S.A. trilogy, comprised of the novels The 42nd Parallel, 1919, and The Big Money, is a grand, kaleidoscopic portrayal of a nation that buzzes with history and life on every page.</p>\n\n<p>The 42nd Parallel unfolds in stories and “newsreels” consisting of front-page headlines and article fragments from the Chicago Tribune, revealing the lives and fortunes of five characters. Mac, Janey, Eleanor, Ward, and Charley are caught on the storm track of this parallel and blown New Yorkward. As their lives cross and double back again, the likes of Eugene Debs, Thomas Edison, and Andrew Carnegie also make appearances.1919 opens to find America and the world at war, and Dos Passos’s characters, many of whom we met in the first volume, are thrown into the snarl. We follow the daughter of a Chicago minister, a wide-eyed Texas girl, a young poet, and a radical Jew, as well as the glimpses of the more famous Woodrow Wilson, Theodore Roosevelt, and the Unknown Soldier.</p>\n\n<p>The Big Money comes back to America after the war to find a nation on the upswing. Industrialism booms, the stock market surges, Lindbergh takes his solo flight, and Henry Ford makes automobiles. From New York to Hollywood, love affairs to business deals, it is a country taking the turns too fast, speeding toward the crash of 1929.Employing a host of experimental devices that would inspire a whole new generation of writers to follow, Dos Passos captures the many textures, flavors, and background noises of modern life with a cinematic touch and unparalleled nerve.</p>"
}