{
  "book_id": 3271,
  "book_uuid": "c4e9d225-8524-4da8-b7a4-44a1dc565da6",
  "title": "The Ascent of Money: A Financial History of the World",
  "pubdate": "2008-05-14 20:00:00+00:00",
  "isbn": "",
  "author_name": "Niall Ferguson",
  "publisher_name": "Penguin Press",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "General",
    "History",
    "Business & Economics",
    "Economics",
    "Large type books",
    "Finance",
    "World",
    "International finance - History",
    "International finance",
    "Money - History",
    "International",
    "Money",
    "Economics - History",
    "Finance - History",
    "Money & Monetary Policy",
    "Economic History"
  ],
  "description": "<p class=\"description\">SUMMARY:<br>Niall Ferguson follows the money to tell the human story behind the evolution of finance, from its origins in ancient Mesopotamia to the latest upheavals on what he calls Planet Finance. Bread, cash, dosh, dough, loot, lucre, moolah, readies, the wherewithal: Call it what you like, it matters. To Christians, love of it is the root of all evil. To generals, itas the sinews of war. To revolutionaries, itas the chains of labor. But in \"The Ascent of Money,\" Niall Ferguson shows that finance is in fact the foundation of human progress. Whatas more, he reveals financial history as the essential backstory behind all history. Through Fergusonas expert lens familiar historical landmarks appear in a new and sharper financial focus. Suddenly, the civilization of the Renaissance looks very different: a boom in the market for art and architecture made possible when Italian bankers adopted Arabic mathematics. The rise of the Dutch republic is reinterpreted as the triumph of the worldas first modern bond market over insolvent Habsburg absolutism. And the origins of the French Revolution are traced back to a stock market bubble caused by a convicted Scot murderer. With the clarity and verve for which he is known, Ferguson elucidates key financial institutions and concepts by showing where they came from. What is money? What do banks do? Whatas the difference between a stock and a bond? Why buy insurance or real estate? And what exactly does a hedge fund do? This is history for the present. Ferguson travels to post-Katrina New Orleans to ask why the free market canat provide adequate protection against catastrophe. He delves into the origins of the subprime mortgage crisis. Perhaps most important, \"The Ascent of Money\" documents how a new financial revolution is propelling the worldas biggest countries, India and China, from poverty to wealth in the space of a single generationaan economic transformation unprecedented in human history. Yet the central lesson of the financial history is that sooner or later every bubble burstsasooner or later the bearish sellers outnumber the bullish buyers, sooner or later greed flips into fear. And thatas why, whether youare scraping by or rolling in it, thereas never been a better time to understand the ascent of money.</p>"
}