{
  "book_id": 3274,
  "book_uuid": "fb3871a3-8523-45f1-af55-89ec95b24654",
  "title": "Evil at Heart",
  "pubdate": "2009-09-01 04:00:00+00:00",
  "isbn": "",
  "author_name": "Chelsea Cain",
  "publisher_name": "New York : Minotaur Books, 2009.",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "Mystery & Detective",
    "Suspense",
    "Police Procedural",
    "Thrillers",
    "Mystery fiction",
    "Police",
    "Oregon",
    "Crime",
    "Portland (Or.)",
    "Police - Oregon - Portland",
    "Women serial murderers",
    "Portland"
  ],
  "description": "<div><h3>From Publishers Weekly</h3><p>Gretchen Lowell strikes again—or does she?—in bestseller Cain's grisly third thriller to feature the female serial killer who takes sadistic pleasure in taunting Portland, Ore., detective Archie Sheridan (after <em>Sweetheart</em> and <em>Heartsick</em>). A violent attack that leaves body parts in a rest stop bathroom, along with Lowell's signature heart design, persuades Sheridan, a recovering Vicodin addict, to leave rehab and rejoin the hunt for Lowell. As he and newspaper reporter Susan Ward dig deeper, they discover that while the corpses cropping up around town are reminiscent of Lowell's nasty handiwork, they might also point to one of the myriad fan clubs dedicated to the killer, who has become a media sensation since she escaped from prison in <em>Heartsick</em>. Even though readers may wonder how much longer this extended game can play out, Cain delivers her usual blend of organ-ripping, blood-soaked gore and compelling flawed heroes—and antiheroes. <em>(Sept.)</em> <br>Copyright © Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. </p><h3>Review</h3><p>Praise for Chelsea Cain </p><p>_Sweetheart </p><p>_“Cain’s debut <em>Heartsick</em> had even the most jaded thriller fans sleeping with the lights on. She tells an equally frightening story in Sweetheart. . . . This is one of the best series in the contemporary thriller genre. Only downside: waiting for Cain’s next novel.”<br>---_USA Today<br>_<br>“Cain skillfully recruits us as moral caretakers as Archie struggles to overcome his sexual Stockholm Syndrome. . . . She invents Gretchen in wanton, wide-screen glory. . . . The novel is sensual and engulfing.”<br>---_The New York Times Book Review_ </p><p>“The forces that conspired to make Cain’s <em>Heartsick</em> a bestselling page-turner last year have reunited in its sequel. . . . With her preternatural grasp of pacing and ability to create vivid characters with astonishing economy, Cain expertly drives her narrative.”<br>---_Los Angeles Times_ </p><p>“We’ve been down Hannibal Lecter Avenue many times, and these two books shouldn’t work . . . but they do. Chalk it up to excellent writing and Cain’s ferocious sense of humor. The Portland (Ore.) setting is refreshing too.”<br>---Stephen King, <em>Entertainment Weekly</em> </p><p>_Heartsick </p><p><em>“</em>Heartsick_ is worth all the hype . . . brilliant.”<br>---_New York Post_ </p><p>“In her dynamite first thriller, Cain introduces one of the most seductive and original psychopaths since Hannibal Lecter.”<br>---_Entertainment Weekly<br>_<br>“Steamy and perverse.”<br>---_The New York Times_</p> </div>"
}