{
  "book_id": 3300,
  "book_uuid": "43f8fa2c-fa22-4bf6-97bf-b17d58b44268",
  "title": "A Breath of Snow and Ashes",
  "pubdate": "2005-01-01 05:00:00+00:00",
  "isbn": "",
  "author_name": "Diana Gabaldon",
  "publisher_name": "DELL",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "Fantasy",
    "Historical",
    "Azizex666"
  ],
  "description": "<div><p>Eagerly anticipated by her legions of fans, this sixth novel in Diana Gabaldon’s bestselling Outlander saga is a masterpiece of historical fiction from one of the most popular authors of our time.<br></p><p>Since the initial publication of <strong>Outlander</strong> fifteen years ago, Diana Gabaldon’s <em>New York Times</em> bestselling saga has won the hearts of readers the world over — and sold more than twelve million books. Now, <strong>A Breath of Snow and Ashes</strong> continues the extraordinary story of 18th-century Scotsman Jamie Fraser and his 20th-century wife, Claire.<br></p><p>The year is 1772, and on the eve of the American Revolution, the long fuse of rebellion has already been lit. Men lie dead in the streets of Boston, and in the backwoods of North Carolina, isolated cabins burn in the forest.<br></p><p>With chaos brewing, the governor calls upon Jamie Fraser to unite the backcountry and safeguard the colony for King and Crown. But from his wife Jamie knows that three years hence the shot heard round the world will be fired, and the result will be independence — with those loyal to the King either dead or in exile. And there is also the matter of a tiny clipping from <em>The Wilmington Gazette</em>, dated 1776, which reports Jamie’s death, along with his kin. For once, he hopes, his time-traveling family may be wrong about the future.<br></p><p><em>From the Hardcover edition.</em></p><h3>From Booklist</h3><p>After waiting nearly four years since <em>The Fiery Cross</em> (2001), readers will find every expectation fulfilled in the sixth book of the popular Outlander series. Gabaldon shines as she unfolds the continuing story of the Frasers, heartbreakingly heroic highlander Jamie and his time-traveling wife Clare. Set during the three years leading up to the American Revolution, this compulsively readable mix of authentically set historical fiction and completely satisfying romance maps both violent loss and strong family ties. On the eve of war much is changing on Fraser's Ridge and Jamie and Claire encounter much harm. This vivid and haunting novel, therefore, brings an aching sadness, but it is balanced with sheer joy, revelation, and solace. The large scope of the novel allows Gabaldon to do what she does best, paint in exquisite detail the lives of her characters. Gabaldon's ability to invoke the heroic and the harrowing writ large, while also creating moments where you dare not take a breath for fear of missing something tiny and fine, is her hallmark. For it is in describing the sound of rain on the roof, Jamie's injured hand, or the understanding between father and daughter that the world of the novel comes alive and offers readers an enthralling experience. <em>Neal Wyatt</em><br><em>Copyright © American Library Association. All rights reserved</em></p><h3>Review</h3><p>“The sixth instalment of the adventures of Claire and Jamie Fraser, already number one on the bestseller list, is a whopping 980 pages of action-packed escapism. It also has surprisingly melancholy and insightful views on the experience of growing old and dealing with the losses that entails…. One of the things that sets Gabaldon apart from other romance writers is exhaustive research of the times in which her characters live, so evident in her attention to period detail…. plot lines and stand-alone yarns are expertly woven together with the overall theme of impending doom and the question of predetermination.” — <em>The Toronto Star</em> <br></p><p>“Fans of Diana Gabaldon’s popular Outlander series have another rousing historical-science-fiction-romance novel to savour in <strong>A Breath of Snow and Ashes</strong>…. For fans, this book is another slam-dunk hit. It’s a massive, long-lasting source of entertainment.” — <em>The Gazette</em> (Montreal)<br></p><p><strong>Praise for Diana Gabaldon:</strong><br>“Riveting. Gabaldon has a true storyteller’s voice.”—<em>The Globe and Mail</em><br></p><p>“Triumphant. . . . Her use of historical detail and truly adult love story confirm Gabaldon as a superior writer.”—<em>Publishers Weekly</em><br></p><p>“Diana Gabaldon is a born storyteller. . . . The pages practically turn themselves.”—*Arizona Republic<br></p><p><em>\"Readers will find every expectation fulfilled.... The large scope of the novel allows Gabaldon to do what she does best, paint in exquisite detail the lives of her characters.\"—B</em>ooklist *<br></p><p><em>From the Hardcover edition.</em></p></div>"
}