{
  "book_id": 3307,
  "book_uuid": "ee9228c8-8377-4fff-872a-0245efd601fb",
  "title": "Liss 4 - The Whiskey Rebel",
  "pubdate": "2011-03-20 05:00:00+00:00",
  "isbn": "",
  "author_name": "David Liss",
  "publisher_name": "unknown",
  "series_name": "",
  "series_index": 1.0,
  "tags": [],
  "description": "<p class=\"description\">David Liss's bestselling historical thrillers, including A Conspiracy of Paper and The Coffee Trader, have been called remarkable and rousing: the perfect combination of scrupulous research and breathless excitement. Now Liss delivers his best novel yet in an entirely new setting – America in the years after the Revolution, an unstable nation where desperate schemers vie for wealth, power, and a chance to shape a country's destiny. Ethan Saunders, once among General Washington's most valued spies, now lives in disgrace, haunting the taverns of Philadelphia. An accusation of treason has long since cost him his reputation and his beloved fiancée, Cynthia Pearson, but at his most desperate moment he is recruited for an unlikely task – finding Cynthia's missing husband. To help her, Saunders must serve his old enemy, Treasury Secretary Alexander Hamilton, who is engaged in a bitter power struggle with political rival Thomas Jefferson over the fragile young nation's first real financial institution: the Bank of the United States. Meanwhile, Joan Maycott is a young woman married to another Revolutionary War veteran. With the new states unable to support their ex-soldiers, the Maycotts make a desperate gamble: trade the chance of future payment for the hope of a better life on the western Pennsylvania frontier. There, amid hardship and deprivation, they find unlikely friendship and a chance for prosperity with a new method of distilling whiskey. But on an isolated frontier, whiskey is more than a drink; it is currency and power, and the Maycotts' success attracts the brutal attention of men in Hamilton 's orbit, men who threaten to destroy all Joan holds dear. As their causes intertwine, Joan and Saunders – both patriots in their own way – find themselves on opposing sides of a daring scheme that will forever change their lives and their new country. The Whiskey Rebels is a superb rendering of a perilous age and a nation nearly torn apart – and David Liss's most powerful novel yet.</p>"
}