{
  "book_id": 3352,
  "book_uuid": "de85a128-1e3b-412d-9c7c-14ff8c427694",
  "title": "Lost in a Good Book: A Thursday Next Novel",
  "pubdate": "2004-02-24 05:00:00+00:00",
  "isbn": "",
  "author_name": "Jasper Fforde",
  "publisher_name": "Penguin",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "Fantasy",
    "Mystery & Detective",
    "Women Sleuths",
    "Literary",
    "Contemporary"
  ],
  "description": "<div>\n<p>NEW YORK TIMES BESTSELLER • From the author of The Constant Rabbit comes “Harry Potter just for adults . . . [an] immensely enjoyable, almost compulsive experience” (The New York Times Book Review)—the second novel in the renowned Thursday Next series. “[Lost in a Good Book] is satire, fantasy, literary criticism, thriller, whodunit, game, puzzle, joke, postmodern prank, and tilt-a-whirl.”—The Washington Post If resourceful, fearless literary detective Thursday Next thought she could avoid the spotlight after her heroic escapades in the pages of Jane Eyre, she was sorely mistaken. Her adventures as a renowned Special Operative in literary detection have left Thursday Next yearning for a rest. But when the love of her life is eradicated by the corrupt multinational Goliath Corporation, Thursday must bite the bullet and moonlight as a Prose Resource Operative in the secret world of Jurisfiction, the police force inside the books. There she is apprenticed to Miss Havisham, the famous man-hater from Dickens’s Great Expectations, who teaches her to book-jump like a pro. If Thursday retrieves a supposedly vanquished enemy from the pages of Poe’s “The Raven,” she thinks Goliath might return her lost love, Landen. But her latest mission is endlessly complicated. Not only are there side trips into the works of Kafka and Austen, and even Beatrix Potter’s The Tale of Flopsy Bunnies, Thursday finds herself the target of a series of potentially lethal coincidences, the authenticator of a newly discovered play by the Bard himself, and the only one who can prevent an unidentifiable pink sludge from engulfing all life on Earth. Don’t miss any of Jasper Fforde’s delightfully entertaining Thursday Next novels:THE EYRE AFFAIR • LOST IN A GOOD BOOK • THE WELL OF LOST PLOTS • SOMETHING ROTTEN • FIRST AMONG SEQUELS • ONE OF OUR THURSDAYS IS MISSING • THE WOMAN WHO DIED A LOT</p></div>"
}