{
  "book_id": 3358,
  "book_uuid": "217424c3-9a33-4b04-875d-544c139f341f",
  "title": "Outlander",
  "pubdate": "1991-01-01 05:00:00+00:00",
  "isbn": "",
  "author_name": "Diana Gabaldon",
  "publisher_name": "DELL",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "Historical",
    "Azizex666"
  ],
  "description": "<div><p>Claire Randall is leading a double life. She has a husband in one century, and a lover in another...<br></p><p>In 1945, Claire Randall, a former combat nurse, is back from the war and reunited with her husband on a second honeymoon--when she innocently touches a boulder in one of the ancient stone circles that dot the British Isles. Suddenly she is a Sassenach—an \"outlander\"—in a Scotland torn by war and raiding border clans in the year of our Lord...1743.<br></p><p>Hurled back in time by forces she cannot understand, Claire's destiny in soon inextricably intertwined with Clan MacKenzie and the forbidden Castle Leoch. She is catapulted without warning into the intrigues of lairds and spies that may threaten her life ...and shatter her heart. For here, James Fraser, a gallant young Scots warrior, shows her a passion so fierce and a love so absolute that Claire becomes a woman torn between fidelity and desire...and between two vastly different men in two irreconcilable lives.</p><h3>Amazon.com Review</h3><p>In <em>Outlander</em>, a 600-page time-travel romance, strong-willed and sensual Claire Randall leads a double life with a husband in one century, and a lover in another. Torn between fidelity and desire, she struggles to understand the pure intent of her heart. But don't let the number of pages and the Scottish dialect scare you. It's one of the fastest reads you'll have in your library. </p><p>While on her second honeymoon in the British Isles, Claire touches a boulder that hurls her back in time to the forbidden Castle Leoch with the MacKenzie clan. Not understanding the forces that brought her there, she becomes ensnared in life-threatening situations with a Scots warrior named James Fraser. But it isn't all spies and drudgery that she must endure. For amid her new surroundings and the terrors she faces, she is lured into love and passion like she's never known before. </p><blockquote><p>I was lame and sore in every muscle when I woke next morning. I shuffled to the privy closet, then to the wash basin. My innards felt like churned butter. It felt as though I had been beaten with a blunt object, I reflected, then thought that that was very near the truth. The blunt object in question was visible as I came back to bed, looking now relatively harmless. Its possessor [Jamie] woke as I sat next to him, and examined me with something that looked very much like male smugness.\" </p></blockquote><p>Gabaldon creates characters that you'll remember, laugh with, cry with, and cheer for long after you've finished the book. <em>--Candy Paape</em></p><h3>From Publishers Weekly</h3><p>Absorbing and heartwarming, this first novel lavishly evokes the land and lore of Scotland, quickening both with realistic characters and a feisty, likable heroine. English nurse Claire Beauchamp Randall and husband Frank take a second honeymoon in the Scottish Highlands in 1945. When Claire walks through a cleft stone in an ancient henge, she's somehow transported to 1743. She encounters Frank's evil ancestor, British captain Jonathan \"Black Jack\" Randall, and is adopted by another clan. Claire nurses young soldier James Fraser, a gallant, merry redhead, and the two begin a romance, seeing each other through many perilous, swashbuckling adventures involving Black Jack. Scenes of the Highlanders' daily life blend poignant emotions with Scottish wit and humor. Eventually Sassenach (outlander) Claire finds a chance to return to 1945, and must choose between distant memories of Frnak and her happy, uncomplicated existence with Jamie. Claire's resourcefulness and intelligent sensitivity make the love-conquers-all, happily-ever-after ending seem a just reward. Doubleday Book Club main selection, Literary Guild alternate. <br>Copyright 1991 Reed Business Information, Inc. </p></div>"
}