{
  "book_id": 3384,
  "book_uuid": "5cb66a4e-3e8b-446a-a561-bdbc032a42ab",
  "title": "Horns",
  "pubdate": "2010-01-19 06:00:00+00:00",
  "isbn": "",
  "author_name": "Joe Hill",
  "publisher_name": "HarperCollins",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "Suspense",
    "Thrillers",
    "Thriller",
    "Fiction - Espionage",
    "Murder",
    "Horror",
    "Horror - General",
    "American Horror Fiction",
    "Revenge"
  ],
  "description": "<p class=\"description\">EDITORIAL REVIEW: Joe Hill has been hailed as \"a major player in 21st-century fantastic fiction\" (*Washington Post*); \"a new master in the field of suspense\" (James Rollins); \"one of the most confident and assured new voices in horror and dark fantasy to emerge in recent years (*Publishers Weekly*); a writer who \"builds character invitingly and plants an otherworldly surprise around every corner\" (*New York Times*). This gifted and brilliantly imaginative author catapulted to bestsellerdom with the chilling *Heart-Shaped Box* and cemented his reputation with the prizewinning volume of short fiction *20th Century Ghosts*. At last, the *New York Times* bestselling author returns with a relentless supernatural thriller that runs like *Hell* on wheels. . . . Ignatius Perrish spent the night drunk and doing terrible things. He woke up the next morning with a thunderous hangover, a raging headache . . . and a pair of horns growing from his temples. At first Ig thought the horns were a hallucination, the product of a mind damaged by rage and grief. He had spent the last year in a lonely, private purgatory, following the death of his beloved, Merrin Williams, who was raped and murdered under inexplicable circumstances. A mental breakdown would have been the most natural thing in the world. But there was nothing natural about the horns, which were all too real. Once the righteous Ig had enjoyed the life of the blessed: born into privilege, the second son of a renowned musician and younger brother of a rising late-night TV star, he had security, wealth, and a place in his community. Ig had it *all*, and more—he had Merrin and a love founded on shared daydreams, mutual daring, and unlikely midsummer magic. But Merrin's death damned all that. The only suspect in the crime, Ig was never charged or tried. And he was never cleared. In the court of public opinion in Gideon, New Hampshire, Ig is and always will be guilty because his rich and connected parents pulled strings to make the investigation go away. Nothing Ig can do, nothing he can say, matters. Everyone, it seems, including God, has abandoned him. Everyone, that is, but the devil inside. . . . Now Ig is possessed of a terrible new power to go with his terrible new look—a macabre talent he intends to use to find the monster who killed Merrin and destroyed his life. Being good and praying for the best got him nowhere. It's time for a little revenge. . . . *It's time the devil had his due. . . .*</p>"
}