{
  "book_id": 3415,
  "book_uuid": "f70835db-5941-4b61-8ae5-f2e99cf3b320",
  "title": "The Stories of John Cheever",
  "pubdate": "2011-04-19 05:00:00+00:00",
  "isbn": "",
  "author_name": "John Cheever",
  "publisher_name": "Vintage",
  "series_name": "",
  "series_index": 1.0,
  "tags": [],
  "description": "<div><h3><font class=\"Apple-style-span\" size=\"3\"><span class=\"Apple-style-span\" style=\"font-size: 12px; font-weight: normal;\"><p class=\"description\">Think of John Cheever's fiction, and a whole world springs to mind—a world of leafy suburbs, summer houses, commuter trains, boarding schools, and inevitably, his own chosen territory, the cocktail hour among WASPs. But it's a mistake to approach Cheever as if he were merely some sort of anthropologist documenting the customs of an obscure and vanishing tribe. Nostalgia and class issues aside, his true subject is the darkness hidden beneath the surface of postwar American life. A case in point is his famous story \"The Swimmer,\" in which an ebullient Neddy Merrill decides to swim home across the backyard pools of his neighbors. In the course of his journey, however, summer gives way to autumn, his neighbors turn against him, there are troubling intimations of disgrace and financial ruin, and he arrives to find his house both locked and empty.</p><p class=\"description\">Though these stories deal with bright, prosperous, ostensibly happy people, a cold wind blows through them. Age, illness, financial embarrassment, sex, alcohol, death—all of these threaten his suburban Eden. (Is it himself Cheever is mocking in his ironic \"The Worm in the Apple\"? \"Everyone in the community with wandering hands had given them both a try but they had been put off. What was the source of this constancy? Were they frightened? Were they prudish? Were they monogamous? What was at the bottom of this appearance of happiness?\") Inanimate objects carry the residue of their past owners' unhappiness and cruelty (\"Seaside Houses,\" \"The Lowboy\"); expatriates long for but cannot quite find their way home (\"The Woman Without A Country,\" \"Boy in Rome\"); children vanish or turn out badly (too many stories to count).</p><p class=\"description\">All of this is conveyed in prose both graceful and tender. No one is better than Cheever at describing a character's appearance: \"He was a cheerful, heavy man with a round face that looked exactly like a pudding. Everyone was glad to see him, as one is glad to see, at the end of a meal, the appearance of a bland, fragrant, and nourishing dish made of fresh eggs, nutmeg, and country cream.\" Given his uncanny eye (and ear) for realistic description, it's easy to forget how<em>experimental</em> Cheever could be. His later stories pioneered authorial intrusions in the best postmodern style, and from the beginning, he wrote what would much later be called magical realism. (Think of the sinister broadcasts in \"The Enormous Radio,\" or the phantom love interest in \"The Chimera.\") A literary event at its publication and winner of the Pulitzer Prize in 1979, <em>The Stories of John Cheever</em> remains a stunning and enormously influential book. <em>—Mary Park</em></p><h3>Review</h3><p class=\"description\">\"Cheever has created a universe of unforgettable people, places and things.\" -_Chicago Sun-Times_</p><p class=\"description\">\"Profound and daring...some of the most wonderful stories any American has written.\" -_The Boston Globe_</p><p class=\"description\"><em>From the Trade Paperback edition.</em> —<em>Review</em></p></span></font></h3></div>"
}