{
  "book_id": 3525,
  "book_uuid": "6e5bcc3d-cb19-4b01-bcca-770d6b6c44f3",
  "title": "Collapse: How Societies Choose to Fail or Succeed",
  "pubdate": "2011-01-03 21:00:00+00:00",
  "isbn": "",
  "author_name": "Jared M. Diamond",
  "publisher_name": "Penguin Group USA",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "General",
    "Social Science",
    "Sociology",
    "History",
    "Political Science",
    "Public Policy",
    "Nature",
    "Ecology",
    "World",
    "Environmental Policy",
    "Historical Geography",
    "Civilization",
    "Social History"
  ],
  "description": "<div><h3>Amazon.com Review</h3><p>Jared Diamond's <em>Collapse: How Societies Choose to Fail or Succeed</em> is the glass-half-empty follow-up to his Pulitzer Prize-winning <em>Guns, Germs, and Steel</em>. While <em>Guns, Germs, and Steel</em> explained the geographic and environmental reasons why some human populations have flourished, <em>Collapse</em> uses the same factors to examine why ancient societies, including the Anasazi of the American Southwest and the Viking colonies of Greenland, as well as modern ones such as Rwanda, have fallen apart. Not every collapse has an environmental origin, but an eco-meltdown is often the main catalyst, he argues, particularly when combined with society's response to (or disregard for) the coming disaster. Still, right from the outset of <em>Collapse</em>, the author makes clear that this is not a mere environmentalist's diatribe. He begins by setting the book's main question in the small communities of present-day Montana as they face a decline in living standards and a depletion of natural resources. Once-vital mines now leak toxins into the soil, while prion diseases infect some deer and elk and older hydroelectric dams have become decrepit. On all these issues, and particularly with the hot-button topic of logging and wildfires, Diamond writes with equanimity. </p><p>Because he's addressing such significant issues within a vast span of time, Diamond can occasionally speak too briefly and assume too much, and at times his shorthand remarks may cause careful readers to raise an eyebrow. But in general, Diamond provides fine and well-reasoned historical examples, making the case that many times, economic and environmental concerns are one and the same. With <em>Collapse</em>, Diamond hopes to jog our collective memory to keep us from falling for false analogies or forgetting prior experiences, and thereby save us from potential devastations to come. While it might seem a stretch to use medieval Greenland and the Maya to convince a skeptic about the seriousness of global warming, it's exactly this type of cross-referencing that makes <em>Collapse</em> so compelling. <em>--Jennifer Buckendorff</em></p><h3>From Publishers Weekly</h3><p>In the Pulitzer-Prize-winning <em>Guns, Germs, and Steel</em>, Diamond chronicled the rise of human civilizations since the Ice Age. This time, he turns over the log and probes the rotted side--the demise of once-productive societies such as the Maya, Easter Islanders and Greenland Norse. He also sounds the alarm on environmental practices undermining modern societies, including China, Russia, Australia and the United States. Narrator Murney has his work cut out for him, even though this audiobook is abridged. The narrative, which spans the globe and the ages, is dense, overwhelmingly so at times. Diamond parses myriad ecological, geographical and biological impacts, from weather patterns to deforestation to sperm count. But Murney rises to the occasion. His engagement never flags, and he strikes all the proper notes of concern and warning. The delivery feels effortless, his tone a blend of newsreel narrator and professor-at-the-lectern. Diamond teaches geography at UCLA, and his prose style, unsurprisingly, contains shades of the lecture hall. In fact, given such abundant and oft-alarming information, listeners may feel the urge to take notes for the final exam. Though grounding materials such as photographs and maps would have made this audiobook easier to follow, their absence is a minor fault in an overall fine production. <br>Copyright © Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. </p>\n\n</div>"
}