{
  "book_id": 3573,
  "book_uuid": "0ee25d16-3270-4b8f-8aa1-e75346a1cf53",
  "title": "Tigana",
  "pubdate": "1999-12-01 04:31:24+00:00",
  "isbn": "",
  "author_name": "Guy Gavriel Kay",
  "publisher_name": "ROC",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "General",
    "Fantasy",
    "Fantasy fiction",
    "Epic"
  ],
  "description": "<h3>From Publishers Weekly</h3><p>Kay ( The Fionavar Tapestry ) brings to life a layered, pragmatic world of magic and difficult choices, where brutality and beauty coexist. Eight of the nine provinces of the Peninsula of the Palm, on a world with two moons, have fallen to the warrior sorcerers Brandin of Ygrath and Alberico of Barbadior. Brandin's younger son is slain in a battle with the principality of Tigana, which the grief-stricken sorcerer then destroys. Years later, a small band of survivors, led by Alessan, last prince of Tigana's royal house, wages psychological warfare, planting seeds for the overthrow of the two tyrants. At the center of these activities are Devin, a gifted young singer; Catriana, a young woman pursued by suspicions of her family's guilt; and Duke Sandre d'Astibar, a wily resistance leader thought dead. Meanwhile, at Brandin's court, Dianora, his favorite concubine and--unknown to anyone, another survivor of Tigana--struggles between her growing love for the often gentle tyrant and her desire for vengeance. Gradually the scene is set for both conquerors to destroy each other and free a land. Tolkien protege Kay's brilliant and complex portrayal of good and evil, high and low, will draw readers to this consuming epic. <br />Copyright 1990 Reed Business Information, Inc. </p><h3>From Library Journal</h3><p>In a desperate attempt to revive the memory of a land banished from existence and to restore freedom to a battered world, a wandering musician and his small band of compatriots traverse a countryside bowed under the weight of its sorcerer-conquerors. The author of \"The Fionavar Tapestry\" trilogy creates a brilliant single-volume epic fantasy, rich in intrigue and subtlety. Memorable characters and cultures add depth to a gracefully plotted story. Highly recommended.<br />Copyright 1990 Reed Business Information, Inc. </p>"
}