{
  "book_id": 3579,
  "book_uuid": "0a00a04b-f7a2-4a36-b17d-8e6514c8864b",
  "title": "Gilead (2005 Pulitzer Prize)",
  "pubdate": "2005-10-14 13:00:00+00:00",
  "isbn": "",
  "author_name": "Marilynne Robinson",
  "publisher_name": "Virago Press Ltd",
  "series_name": "",
  "series_index": 1.0,
  "tags": [],
  "description": "<p class=\"description\">SUMMARY:<br>In 1981, Marilynne Robinson wrote Housekeeping, which won the PEN/Hemingway Award and became a modern classic. Since then, she has written two pieces of nonfiction: Mother Country and The Death of Adam. With Gilead, we have, at last, another work of fiction. As with The Great Fire, Shirley Hazzards's return, 22 years after The Transit of Venus, it was worth the long wait. Books such as these take time, and thought, and a certain kind of genius. There are no invidious comparisons to be made. Robinson's books are unalike in every way but one: the same incisive thought and careful prose illuminate both. The narrator, John Ames, is 76, a preacher who has lived almost all of his life in Gilead, Iowa. He is writing a letter to his almost seven-year-old son, the blessing of his second marriage. It is a summing-up, an apologia, a consideration of his life. Robinson takes the story away from being simply the reminiscences of one man and moves it into the realm of a meditation on fathers and children, particularly sons, on faith, and on the imperfectability of man. The reason for the letter is Ames's failing health. He wants to leave an account of himself for this son who will never really know him. His greatest regret is that he hasn't much to leave them, in worldly terms. \"Your mother told you I'm writing your begats, and you seemed very pleased with the idea. Well, then. What should I record for you?\" In the course of the narrative, John Ames records himself, inside and out, in a meditative style. Robinson's prose asks the reader to slow down to the pace of an old man in Gilead, Iowa, in 1956. Ames writes of his father and grandfather, estranged over his grandfather's departure for Kansas to march for abolition and his father's lifelong pacifism. The tension between them, their love for each other and their inability to bridge the chasm of their beliefs is a constant source of rumination for John Ames. Fathers and sons. The other constant in the book is Ames's friendship since childhood with \"old Boughton,\" a Presbyterian minister. Boughton, father of many children, favors his son, named John Ames Boughton, above all others. Ames must constantly monitor his tendency to be envious of Boughton's bounteous family; his first wife died in childbirth and the baby died almost immediately after her. Jack Boughton is a ne'er-do-well, Ames knows it and strives to love him as he knows he should. Jack arrives in Gilead after a long absence, full of charm and mischief, causing Ames to wonder what influence he might have on Ames's young wife and son when Ames dies. These are the things that Ames tells his son about: his ancestors, the nature of love and friendship, the part that faith and prayer play in every life and an awareness of one's own culpability. There is also reconciliation without resignation, self-awareness without deprecation, abundant good humor, philosophical queries--Jack asks, \"'Do you ever wonder why American Christianity seems to wait for the real thinking to be done elsewhere?'\"--and an ongoing sense of childlike wonder at the beauty and variety of God's world. In Marilynne Robinson's hands, there is a balm in Gilead, as the old spiritual tells us. --Valerie Ryan</p>"
}