{
  "book_id": 3599,
  "book_uuid": "a1372cfd-b8c5-40a3-b747-f71f260e6d89",
  "title": "Thirteen Reasons Why",
  "pubdate": "2011-06-14 04:00:00+00:00",
  "isbn": "",
  "author_name": "Jay Asher",
  "publisher_name": "National Geographic Books",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Juvenile Fiction",
    "General",
    "School & Education",
    "Schools",
    "Psychology",
    "Mysteries & Detective Stories",
    "Suicide",
    "Young Adult Fiction",
    "Bullying",
    "Social Issues",
    "Friendship",
    "Interpersonal Relations",
    "Death & Dying",
    "High schools",
    "Social Themes"
  ],
  "description": "<div>\n<p>THE #1 NEW YORK TIMES AND INTERNATIONAL BESTSELLER**THE BOOK THAT STARTED IT ALL, NOW A NETFLIX ORIGINAL SERIES** “Eerie, beautiful, and devastating.” —Chicago Tribune “A stealthy hit with staying power. . . . thriller-like pacing.” —The New York Times “Thirteen Reasons Why will leave you with chills long after you have finished reading.” —Amber Gibson, NPR’s “All Things Considered” You can’t stop the future.  You can’t rewind the past. The only way to learn the secret . . . is to press play. </p>\n<p>Clay Jensen returns home from school to find a strange package with his name on it lying on his porch. Inside he discovers several cassette tapes recorded by Hannah Baker—his classmate and crush—who committed suicide two weeks earlier. Hannah's voice tells him that there are thirteen reasons why she decided to end her life. Clay is one of them. If he listens, he'll find out why.                 Clay spends the night crisscrossing his town with Hannah as his guide. He becomes a firsthand witness to Hannah's pain, and as he follows Hannah’s recorded words throughout his town, what he discovers changes his life forever. </p>\n<p>Need to talk? Call 1-800-273-TALK (8255) anytime if you are in the United States. It’s free and confidential. Find more resources at 13reasonswhy.info.   Find out how you can help someone in crisis at bethe1to.com.</p></div>"
}