{
  "book_id": 3641,
  "book_uuid": "54d7d0f1-ab88-41e2-b531-ba6a4f229109",
  "title": "The Night Circus",
  "pubdate": "2010-01-01 06:00:00+00:00",
  "isbn": "",
  "author_name": "Erin Morgenstern",
  "publisher_name": "Doubleday",
  "series_name": "",
  "series_index": 1.0,
  "tags": [],
  "description": "<div><h3>Amazon.com Review</h3><p><strong>Amazon Best Books of the Month, September 2011</strong>: Erin Morgenstern’s dark, enchanting debut takes us to the black and white tents of <em>Le Cirque des Reves</em>, a circus that arrives without warning, simply appearing when yesterday it was not there. Young Celia and Marco have been cast into a rivalry at <em>The Night Circus</em>, one arranged long ago by powers they do not fully understand. Over time, their lives become more intricately enmeshed in a dance of love, joy, deceit, heartbreak, and magic. Author Morgenstern knows her world inside and out, and she guides the reader with a confident hand. The setting and tone are never less than mesmerizing. The characters are well-realized and memorable. But it is the Night Circus itself that might be the most memorable of all. --<em>Chris Schluep</em></p><h3>Review</h3><p>Praise for THE NIGHT CIRCUS:<br></p><p>\"<em>The Night Circus</em> made me happy. Playful and intensely imaginative, Erin Morgenstern has created the circus I have always longed for and she has populated it with dueling love-struck magicians, precocious kittens, hyper-elegant displays of beauty and complicated clocks. This is a marvelous book.\"<br><strong>-- Audrey Niffenegger, author of *The Time Traveler’s Wife</strong>*<br></p><p>\"Debut author Morgenstern doesn't miss a beat in this smashing tale of greed, fate, and love...a giant, magical story destined for bestsellerdom. This is an electric debut on par with <em>Special Topics in Calamity Physics</em>.\"<br><em>*--Publishers Weekly, starred review<br></em></p><em><hr><p>\"Self-assured, entertaining debut that blends genres and crosses continents in quest of magic... Generous in its vision and fun to read. Likely to be a big book—and, soon, a big movie, with all the franchise trimmings.\"<br>—<em><em>Kirkus</em> Reviews, starred review<br></em></p><em><p><strong>\"This big and compelling first novel ushers in a menacing tone with its first sentence: \"The circus arrives without warning.\"...With appeal for readers not particularly geared to fantasy but who plainly enjoy an unusual and well-drawn story, this one will make a good crossover suggestion.\"<br></strong>--<em>Booklist, starred review</em><br><strong><br>“‘Dark as soot and bright as sparks,’ <em>The Night Circus</em> still holds me willingly captive in a world of almost unbearable beauty. This is a love story on a grand scale: it creates, it destroys, it ultimately transcends. Take a bow, Erin Morgenstern. This is one of the best books I have ever read.” <br>—</strong>Brunonia Barry, author of <em>The Lace Reader</em><em><br><br>“A riveting debut. <em>The Night Circus </em>pulls you into a world as dark as it is dazzling, fully-realized but still something out of a dream. You will not want to leave it.”&lt;... </em></p><em></em></em></em></div>"
}