{
  "book_id": 3651,
  "book_uuid": "9e5d6b21-4213-48b3-9277-dec4bf925915",
  "title": "Super Sad True Love Story: A Novel",
  "pubdate": "2010-07-27 04:00:00+00:00",
  "isbn": "",
  "author_name": "Gary Shteyngart",
  "publisher_name": "Random House",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "General",
    "Fiction - General",
    "Love stories",
    "American Contemporary Fiction - Individual Authors +",
    "Satire",
    "Dystopias"
  ],
  "description": "EDITORIAL REVIEW:\n\nThe author of two critically acclaimed novels, **The Russian Debutante’s Handbook** and **Absurdistan**, Gary Shteyngart has risen to the top of the fiction world. Now, in his hilarious and heartfelt new novel, he envisions a deliciously dark tale of America’s dysfunctional coming years—and the timeless and tender feelings that just might bring us back from the brink.In a very near future—oh, let’s say next Tuesday—a functionally illiterate America is about to collapse. But don’t that tell that to poor Lenny Abramov, the thirty-nine-year-old son of an angry Russian immigrant janitor, proud author of what may well be the world’s last diary, and less-proud owner of a bald spot shaped like the great state of Ohio. Despite his job at an outfit called Post-Human Services, which attempts to provide immortality for its super-rich clientele, death is clearly stalking this cholesterol-rich morsel of a man. And why shouldn’t it? Lenny’s from a different century—he totally loves books (or “printed, bound media artifacts,” as they’re now known), even though most of his peers find them smelly and annoying. But even more than books, Lenny loves Eunice Park, an impossibly cute and impossibly cruel twenty-four-year-old Korean American woman who just graduated from Elderbird College with a major in Images and a minor in Assertiveness.After meeting Lenny on an extended Roman holiday, blistering Eunice puts that Assertiveness minor to work, teaching our “ancient dork” effective new ways to brush his teeth and making him buy a cottony nonflammable wardrobe. But America proves less flame-resistant than Lenny’s new threads. The country is crushed by a credit crisis, riots break out in New York’s Central Park, the city’s streets are lined with National Guard tanks on every corner, the dollar is so over, and our patient Chinese creditors may just be ready to foreclose on the whole mess. Undeterred, Lenny vows to love both Eunice and his homeland. He’s going to convince his fickle new love that in a time without standards or stability, in a world where single people can determine a dating prospect’s “hotness” and “sustainability” with the click of a button, in a society where the privileged may live forever but the unfortunate will die all too soon, there is still value in being a real human being.Wildly funny, rich, and humane, **Super Sad True Love Story** is a knockout novel by a young master, a book in which falling in love just may redeem a planet falling apart."
}