{
  "book_id": 3663,
  "book_uuid": "d3f37c80-49b1-4d64-bd36-c521ff2bae93",
  "title": "Thursday Next: First Among Sequels: A Thursday Next Novel",
  "pubdate": "2007-07-24 04:00:00+00:00",
  "isbn": "",
  "author_name": "Jasper Fforde",
  "publisher_name": "Penguin",
  "series_name": "Thursday Next",
  "series_index": 5.0,
  "tags": [
    "Fiction",
    "Fantasy",
    "Mystery & Detective",
    "Women Sleuths",
    "Literary",
    "Urban"
  ],
  "description": "<div>\n<p>NEW YORK TIMES BESTSELLER • In this “hilarious [and] invigorating romp for all lovers of literature” (Associated Press), Thursday Next returns to rescue reading from certain destruction—again—the “mind-blowing” (The Seattle Times) fifth installment of the renowned Thursday Next series. “[With a] furiously agile imagination . . . Fforde has shaken up genres—fantasy, comedy, crime, sci-fi, parody, literary criticism—and come up with a superb mishmash.”—The Miami Herald Fourteen years after she pegged out at the 1988 SuperHoop, Thursday Next is grappling with a host of problems in the Book World: a recalcitrant new apprentice, the death of Sherlock Holmes, and the inexplicable departure of comedy from the once-hilarious Thomas Hardy novels. The Council of Genres is trying to broker a peace deal between certain antagonistic genres: Racy Novel has been recklessly placed between Ecclesiastical and Feminist, and they are at each other’s throats. Meanwhile, back in Swindon, the government is reporting a dangerously high stupidity surplus, and Thursday’s idle sixteen-year-old son would rather sleep all day than follow his destiny as a member of the ChronoGuard. Not only does she captain the ship Moral Dilemma to the very limits of acceptable narrative possibilities, but Thursday also finds she must face down her most vicious enemy yet: herself. Don’t miss any of Jasper Fforde’s delightfully entertaining Thursday Next novels:THE EYRE AFFAIR • LOST IN A GOOD BOOK • THE WELL OF LOST PLOTS • SOMETHING ROTTEN • FIRST AMONG SEQUELS • ONE OF OUR THURSDAYS IS MISSING • THE WOMAN WHO DIED A LOT</p></div>"
}