{
  "book_id": 3706,
  "book_uuid": "0486ae00-0e8a-4ba2-b516-12a9a38dd987",
  "title": "Riptide",
  "pubdate": "1999-06-30 05:00:00+00:00",
  "isbn": "",
  "author_name": "Douglas Preston; Lincoln Child",
  "publisher_name": "Warner Books",
  "series_name": "",
  "series_index": 1.0,
  "tags": [],
  "description": "<p class=\"description\">SUMMARY:<br>For generations, treasure hunters have tried to unlock the deadly puzzle known as the Water Pit: a labyrinth of shafts and tunnels that honeycombs the heart of a small island off the coast of Maine. Reputed to be the hiding place of pirate treasure, the Water Pit possesses an inexplicable ability to kill those who venture into it, from professionals to innocent explorers. But now one man has made a startling discovery: The Water Pit is actually a carefully designed fortress, conceived for pirates by a renowned seventeenth-century architect who hid his plans in code. Unlocking the code will break the curse of the Water Pit. Or will it? The most comprehensive, high-tech expedition ever assembled has come to Maine and to Dr. Malin Hatch, owner of the island. While the treasure hunters have their reasons for mounting this assault--$2 billion in gold--Hatch has his own motives to join them. For Hatch, whose brother died on Ragged Island thirty years before, the only escape from the curse is through the black swirling waters and bloodstained chambers of the Pit. With more computing power than a small university, the recovery team slowly chips away at the mystery. But as the seekers try to conquer the Pit, men begin to die. Hatch is confronted with his childhood memories of the tragedy even as he is drawn into a complex relationship with a beautiful French diver. All the while, the last, secret chamber of the Pit waits to unleash the most lethal mystery of all. . . .A thriller of the highest order, Riptide is an extraordinary novel of obsession, courage, and adventure. With each nerve-racking page we are swept into the mystery and the challenge of Ragged Island and forced to face the haunting question: Is the Water Pit a gateway to limitless treasure--or to hell itself?</p>"
}