{
  "book_id": 3720,
  "book_uuid": "85406853-cca0-400c-80f8-04afa7e4be53",
  "title": "Clean: The Revolutionary Program to Restore the Body's Natural Ability to Heal Itself",
  "pubdate": "2009-05-01 19:09:06.039666+00:00",
  "isbn": "",
  "author_name": "Alejandro Junger",
  "publisher_name": "HarperCollins",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "General",
    "Health & Fitness",
    "Detoxification (Health)",
    "Healing",
    "Naturopathy",
    "Healthy Living"
  ],
  "description": "<h3>Review</h3><p>“A whole-body, whole-foods plan...designed by a cleansing expert.” (Chicago Tribune ) </p><p>“Alejandro Junger, a hypercharismatic Uruguayan, is poised to become the detox movement’s It Boy” (Elle ) </p><p>“Through “Clean” Dr. Junger teaches us methods of cleansing, not only our physical bodies but also cleansing as a way of life-he shows us the power we have on a day-to-day basis to strive to be the healthiest, positive most beautiful beings possible.” (Donna Karan ) </p><p>“The Clean program works.... I have turned many of my friends on to this program and each one has experienced profound benefits, from weight loss to mental clarity to the end of chronic depression. The wisdom and information contained in this book is deeply helpful and life changing.” (Gwyneth Paltrow ) </p><p>“I have seen the incredible results of the CLEAN program with hundreds of patients, from changing their relationship to food, to weight loss to improving health to enjoying life again. If you want to achieve any of these, CLEAN is the book for you.” (Frank Lipman, M.D. author of SPENT ) </p><p>“With an acute understanding of the interconnectedness of body and mind, CLEAN presents a view of detoxification as a spiritual as well as physical necessity. Dr. Junger has given us a roadmap not only to greater health but also to greater joy.” (Marianne Williamson, author of The Age of Miracles ) </p><p>“Clean is a masterpiece of healing... Dr. Junger shows us how we don’t have to suffer any longer, nor feel tired, sick and weighed down with the sludge of modern life. You will discover that you didn’t know how badly you felt, once you have gotten Clean.” (Mark Hyman, MD, Author of the New York Times best-seller The UltraMind Solution ) </p><p>“I am a /CLEAN/ believer, and I recommend its study and practice with the greatest confidence and enthusiasm.” (Robert Thurman, author of Inner Revolution ) </p><p>“Alejandro Junger, M.D., is his message – brilliant, compassionate and embodied. Clean is visionary medicine, an initiation into the spirit of healing and its author’s credentials prove that science and spirituality are finally dancing cheek to cheek. ” (Gabrielle Roth, author of Sweat Your Prayers: Movement as Spiritual Practice ) </p><h3>Product Description</h3><p>How many of us can honestly say we do not suffer from at least one of the following: </p><ul> <li> Colds or viruses each year </li> <li> Allergies or hay fever </li> <li> Extra pounds that won't come off </li> <li> Restless nights </li> <li> Recurrent indigestion, constipation, or irritable bowel syndrome </li> <li> Itchy skin, acne, or any other troubling skin condition </li> <li> Depression, anxiety, or frequent fatigue </li></ul><p>If you were to seek medical advice for any of the above, you would likely be prescribed pills, topical lotions, injections, or even surgery. Such treatments are used to manage the symptoms and do not address the root of the problem. Too often, doctors treat these common ailments as inevitable costs of living a modern life. The result is a patchwork approach to health care that has become the norm. </p><p>In <em>Clean</em>, a New York City cardiologist and a leader in the field of integrative medicine, Dr. Alejandro Junger offers a major medical breakthrough. Dr. Junger argues that the majority of these common ailments are the direct result of toxic buildup in our systems accumulated through the course of our daily lives. As the toxicity of modern life increases and disrupts our systems on a daily basis, bombarding us through our standard American diet and chemical-filled environments, our ability to handle the load hasn't accelerated at the same rapid pace. The toxins are everywhere, but <em>Clean</em> offers a solution. </p><p><em>Clean</em> is an M.D.'s program that provides all the tools necessary to support and reactivate our detoxification system to its fullest capabilities, and can be easily incorporated into a busy schedule. The effect is transformative: nagging health problems will suddenly disappear, extra weight will drop away, and for the first time in our lives we will experience what it truly means to feel healthy. </p><p>Every day spent on the Clean program is a major step in healing not just the symptom but the root of the problem, effectively and simply. Dr. Junger's life-changing program restores what rightfully belongs to you—your health, vitality, and peace of mind. </p>"
}