{
  "book_id": 3724,
  "book_uuid": "92457362-595d-4444-808c-84f67fe5b650",
  "title": "Dance of Death",
  "pubdate": "2005-06-14 04:00:00+00:00",
  "isbn": "",
  "author_name": "Preston| Douglas",
  "publisher_name": "Hachette Digital, Inc.",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "General",
    "Mystery & Detective",
    "Suspense",
    "Police Procedural",
    "Thrillers",
    "Psychological",
    "Psychological Fiction",
    "Suspense fiction",
    "Brothers",
    "Large type books",
    "Sibling rivalry",
    "Government investigators",
    "Serial murders",
    "False testimony"
  ],
  "description": "<div><h3>From Publishers Weekly</h3><p>The always reliable team of Preston and Child revisit Special FBI Agent Aloysius Pendergast, last seen in 2004's <em>Brimstone</em>, and others from past bestsellers (_Relic_; <em>The Cabinet of Curiosities</em>) in this intriguing thriller set in and around New York City and the halls of the Museum of Natural History. Born a misanthropic loner but driven insane by seeing his parents burned alive when he was a teen, Aloysius's madman brother, Diogenes, has begun murdering Aloysius's friends. Aloysius begs old friend Lt. Vincent D'Agosta to help him defeat his brother, and Vincent does his best while the brothers spar and others die. There are a number of subplots, one involving an ATM robber and flasher known as the Dangler and another focusing on the museum's exhibition of sacred masks, but these fade away as the deadly duel between the brothers takes center stage. Think Sherlock Holmes locked in a death struggle with his smarter brother, Mycroft. Like Brimstone, this novel doesn't end so much as simply pause while the authors work on the next installment. While it's not as good as some of their earlier efforts, it's still pretty darn good. <br>Copyright © Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. </p><h3>From</h3><p>Picking up two months after the events chronicled in <em>Brimstone</em> (2004), which saw the untimely demise of popular series hero FBI Special Agent Pendergast, this new novel by the Preston-Child team brings together characters from previous novels. The people closest to Pendergast are dying in horrible ways, and only one man can be responsible: Diogenes, Pendergast's long-lost brother, who has supposedly been dead for years. Meanwhile, at the New York Museum of Natural History, an internal battle rages over the rightful ownership of some ancient relics. Will these two stories link up? Well, of course, no surprise there. It's how they link up that packs the surprises. This is an ambitious novel with a gimmicky plot that could have landed with a resounding thud. Instead, the story soars; the cast of familiar characters--researcher Margo Green, journalist Bill Smithback, curator Nora Kelly--is given a chance to stretch, and the authors deliver an exhilarating finale. Good stuff, and there's more to come, as the novel's last lines make clear. <em>David Pitt</em><br><em>Copyright © American Library Association. All rights reserved</em></p>\n\n</div>"
}