{
  "book_id": 3726,
  "book_uuid": "1df57ce0-2d4a-42bd-990b-ad7e15a711a0",
  "title": "All the King's Men",
  "pubdate": "2005-10-09 13:00:00+00:00",
  "isbn": "",
  "author_name": "Robert Penn Warren",
  "publisher_name": "Dramatist's Play Service",
  "series_name": "",
  "series_index": 1.0,
  "tags": [],
  "description": "<p class=\"description\">SUMMARY:<br>One of the great classics of American fiction reissued as it was originally written.Winner of the 1947 Pulitzer Prize, All the King's Men is one of the most famous and widely read works in American fiction. Its original publication by Harcourt catapulted author Robert Penn Warren to fame and made the novel a bestseller for many seasons. Set in the 1930s, it traces the rise and fall of demagogue Willie Talos, a fictional Southern politician who resembles the real-life Huey \"Kingfish\" Long of Louisiana. Talos begins his career as an idealistic man of the people, but he soon becomes corrupted by success, caught between dreams of service and a lust for power. All the King's Men is as relevant today as it was fifty years ago.In a momentous publishing event, Robert Penn Warren's masterpiece has been restored and reintroduced by literary scholar Noel Polk, whose work on the texts of William Faulkner has proved so important to American literature. Polk presents the novel as it was originally written, and without the deletions required by its original editors. The result restores Warren's complexity and subtlety to an already near-perfect work, charging the characters with an energy and a more tangled web of relationships than previously was available. All the King's Men is a landmark in letters. This new edition brings it fully to life.\"The publication of a new, corrected edition of All the King's Men is welcome news for all who care about American literature. Robert Penn Warren's prize-winning novel has remained a classic since its publication more than half a century ago. Editor Noel Polk has studied the manuscript and all other available versions of Warren's finest novels, eliminating errors and retrieving deleted material. The result has been to enrich the character of narrator Jack Burden and his protagonist, Willie Talos, in this story of tumultuous Louisiana politics which also has implications for morals and manners in the modern world.\" -Joseph Blotner, author of Robert Penn Warren: A Biography</p>"
}