{
  "book_id": 3757,
  "book_uuid": "6303802f-df59-4488-84e0-43db0dce3d5d",
  "title": "Tell No One/Gone for Good: Two Novels in One Volume",
  "pubdate": "2009-06-24 19:27:22.632586+00:00",
  "isbn": "",
  "author_name": "Harlan Coben",
  "publisher_name": "Random House Publishing Group",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "General",
    "Mystery & Detective",
    "Suspense",
    "Thrillers"
  ],
  "description": "<p>From New York Times bestselling author Harlan Coben comes an unforgettable duet of classic novels—two top-notch thrillers filled with the author’s signature storytelling genius.</p>\n\n<p>TELL NO ONEFor Dr. David Beck, the loss was shattering. And every day for the past eight years, he has relived the horror of what happened. The gleaming lake. The pale moonlight. The piercing screams. The night his wife was taken. The last night he saw her alive. Everyone tells him it’s time to move on, to forget the past once and for all. But for David Beck, there can be no closure. A message has appeared on his computer, a phrase only he and his dead wife know. Suddenly Beck is taunted with the impossible—that somewhere, somehow, his wife is alive…and he’s been warned to tell no one.</p>\n\n<p>“A COMPELLING AND ORIGINAL SUSPENSE THRILLER.” —Los Angeles Times GONE FOR GOOD As a boy, Will Klein had a hero: his older brother, Ken. Then, on a warm suburban night in the Kleins’ affluent New Jersey neighborhood, a young woman—a girl Will had once loved—was found brutally murdered in her family’s basement. The prime suspect: Ken Klein. With the evidence against him overwhelming, Ken simply vanished. And when his shattered family never heard from Ken again, they were sure he was gone for good. Now eleven years have passed. Will has found proof that Ken is alive. And this is just the first in a series of stunning revelations as Will is forced to confront startling truths about his brother, and even himself.</p>\n\n<p>“RIVETING…HAS MORE TWISTS AND TURNS THAN AN AMUSEMENT PARK RIDE.” —USA Today</p>"
}