{
  "book_id": 3761,
  "book_uuid": "2914c587-5a2a-4318-906b-d69aeb995502",
  "title": "Wise Blood",
  "pubdate": "2007-03-01 00:00:00+00:00",
  "isbn": "",
  "author_name": "Flannery O'Connor",
  "publisher_name": "Faber and Faber",
  "series_name": "",
  "series_index": 1.0,
  "tags": [],
  "description": "<div><h3>Amazon.com Review</h3><p><em>Wise Blood</em> is a comedy with a fierce, Old Testament soul. Flannery O'Connor has no truck with such newfangled notions as psychology. Driven by forces outside their control, her characters are as one-dimensional--and mysterious--as figures on a frieze. Hazel Motes, for instance, has the temperament of a martyr, even though he spends most of the book trying to get God to go away. As a child he's convinced that \"the way to avoid Jesus was to avoid sin.\" When that doesn't work, and when he returns from Korea determined \"to be converted to nothing instead of evil,\" he still can't go anywhere without being mistaken for a preacher. (Not that the hat and shiny glare-blue suit help.) No matter what Hazel does, Jesus moves \"from tree to tree in the back of his mind, a wild ragged figure motioning him to turn around and come off into the dark...\"</p><p>Adrift after four years in the service, Hazel takes a train to the city of Taulkinham, buys himself a \"rat-colored car,\" and sets about preaching on street corners for the Church Without Christ, \"where the blind don't see and the lame don't walk and what's dead stays that way.\" Along the way he meets Enoch Emery, who's only 18 years old but already works for the city, as well the blind preacher Asa Hawks and his illegitimate daughter, Sabbath Lily. (Her letter to an advice column: \"Dear Mary, I am a bastard and a bastard shall not enter the kingdom of heaven as we all know, but I have this personality that makes boys follow me. Do you think I should neck or not?\") Subsequent events involve a desiccated, centuries-old dwarf--Gonga the Giant Jungle Monarch--and Hazel's nemesis, Hoover Shoats, who starts the rival Church of Christ Without Christ. If you think these events don't end happily, you might be right.</p><p><em>Wise Blood</em> is a savage satire of America's secular, commercial culture, as well as the humanism it holds so dear (\"Dear Sabbath,\" Mary Brittle writes back, \"Light necking is acceptable, but I think your real problem is one of adjustment to the modern world. Perhaps you ought to re-examine your religious values to see if they meet your needs in Life.\") But the book's ultimate purpose is Religious, with a capital R--no metaphors, no allusions, just the thing itself in all its fierce glory. When Hazel whispers \"I'm not clean,\" for instance, O'Connor thinks he is perfectly right. For readers unaccustomed to holding low comedy and high seriousness in their heads at the same time, all this can come as something of a shock. Who else could offer an allegory about free will, redemption, and original sin right alongside the more elemental pleasure of witnessing Enoch Emery dress up in a gorilla suit? Nobody else, that's who. And that's OK. More than one Flannery O'Connor in this world might show us more truth than we could bear. <em>--Mary Park</em></p><h3>From Publishers Weekly</h3><p>Starred Review. Bronson Pinchot turns in a virtuosic performance of O'Connor's darkly comic classic first novel. After serving a stint in the army, Hazel Motes finds himself adrift, alone, and rent by spiritual confusion. Pinchot's narration is superb: dynamic, well paced, and infused with a perfect Southern drawl. Instead of simply creating voices for the characters, Pinchot embodies them. His Hazel is nasty, nasally, and angry; his Enoch Emery boasts a congested twang; and the entire cast is likewise brought to life by Pinchot's precise and perceptive characterizations and his brilliant evocation of O'Conner's grotesqueries. A Farrar, Straus, and Giroux paperback. (Aug.) <br>(c) Copyright PWxyz, LLC. All rights reserved. </p>\n\n</div>"
}