{
  "book_id": 3782,
  "book_uuid": "24c04671-e721-4baa-81d0-b0122419341a",
  "title": "The Magnificent Ambersons",
  "pubdate": "2006-01-19 13:00:00+00:00",
  "isbn": "",
  "author_name": "Booth Tarkington",
  "publisher_name": "Barnes & Noble Classics",
  "series_name": "",
  "series_index": 1.0,
  "tags": [],
  "description": "<p class=\"description\">SUMMARY:<br>The Magnificent Ambersons, by Booth Tarkington, is part of the Barnes &amp; Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes &amp; Noble Classics: New introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices &amp; Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes &amp; Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. Largely overshadowed by Orson Welles’s famous 1941 screen version, Booth Tarkington’s novel The Magnificent Ambersons was not only a best-seller when it first appeared in 1918—it also won the Pulitzer Prize.Set in the Midwest in the early twentieth century—the dawn of the automobile age—the novel begins by introducing the richest family in town, the Ambersons. Exemplifying aristocratic excess, the Ambersons have everything money can buy—and more. But George Amberson Minafer—the spoiled grandson of the family patriarch—is unable to see that great societal changes are taking place, and that business tycoons, industrialists, and real estate developers will soon surpass him in wealth and prestige. Rather than join the new mechanical age, George prefers to remain a gentleman, believing that “being things” is superior to “doing things.” But as his town becomes a city, and the family palace is enveloped in a cloud of soot, George’s protectors disappear one by one, and the elegant, cloistered lifestyle of the Ambersons fades from view, and finally vanishes altogether.A brilliant portrayal of the changing landscape of the American dream, The Magnificent Ambersons is a timeless classic that deserves a wider modern audience. Nahma Sandrow has written extensively about theater and cultural history, including the books Vagabond Stars: A World History of Yiddish Theater and Surrealism: Theater, Arts, Ideas. For many years a professor at Bronx Community College of the City University of New York, she has lectured at Oxford University, Harvard University, the Smithsonian, and elsewhere.</p>"
}