{
  "book_id": 3829,
  "book_uuid": "27fbf380-4238-4e62-ad80-c8ac32ae12eb",
  "title": "The Reapers",
  "pubdate": "2008-01-01 05:00:00+00:00",
  "isbn": "",
  "author_name": "John Connolly",
  "publisher_name": "Hodder Paperback",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "General",
    "Mystery & Detective",
    "Thrillers",
    "Azizex666"
  ],
  "description": "<p class=\"description\">A brilliantly chilling novel by New York Times bestselling author John Connolly about a chain of killings, linked obscurely by great distances and the passage of years, and the settling of their blood-debts -- past, present, and future.   As a small boy, Louis witnesses an unspeakable crime that takes the life of a member of his small, southern community. He grows up and moves on, but he is forever changed by the cruel and brutal nature of the act. It lights a fire deep within him that burns white and cold, a quiet flame just waiting to ignite. Now, years later, the sins of his life are reaching into his present, bringing with them the buried secrets and half-forgotten acts of his past.   Someone is hunting him, targeting his home, his businesses, and his partner, Angel. The instrument of revenge is Bliss, a killer of killers, the most feared of assassins. Bliss is a Reaper, a lethal tool to be applied toward the ultimate end, but he is also a man with a personal vendetta.   Hardened by their pasts, Louis and Angel decide to strike back. While they form a camaraderie that brings them solace, it offers them no shelter from the fate that stalks them. When they mysteriously disappear, their friends are forced to band together to find them. They are led by private detective Charlie Parker, a killer himself, a Reaper in waiting.   Connolly's triumphant prose and unerring rendering of his tortured characters mesmerize and chill. He creates a world where everyone is corrupt, murderers go unpunished, but betrayals are always avenged. Yet another masterpiece from a proven talent, The Reapers will terrify and transfix.</p>"
}