{
  "book_id": 3928,
  "book_uuid": "a50b9b19-37f8-4551-9cf5-f18812e5817c",
  "title": "206 Bones",
  "pubdate": "2010-06-22 05:00:00+00:00",
  "isbn": "",
  "author_name": "Kathy Reichs",
  "publisher_name": "Simon and Schuster",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "General",
    "Mystery & Detective",
    "Suspense",
    "Women Sleuths",
    "Thrillers",
    "Women",
    "Mystery fiction",
    "Women - Crimes against",
    "Crimes against",
    "Chicago (Ill.)",
    "Brennan",
    "Temperance (Fictitious character)",
    "Women forensic anthropologists",
    "Montreal (Quebec)",
    "Montréal (Québec)",
    "Sabotage"
  ],
  "description": "<div><h3>From Publishers Weekly</h3><p>Starred Review. At the start of bestseller Reichs's outstanding 12th thriller to feature Dr. Temperance Brennan (after <em>Devil Bones</em>), Brennan finds herself bound and injured in an underground tomb. In flashbacks, Reichs fills in the how and why of the forensic anthropologist's deadly predicament. When Brennan and Andrew Ryan of the Sûreté du Québec arrive in Chicago on business, she's accused of botching the autopsy of Rose Jurmain, a Canadian heiress. Knowing only that an anonymous caller instigated the investigation, Brennan is determined to uncover who's out to sabotage her. Back in her Montreal lab, Brennan soon realizes that not only is Jurmain's death possibly linked to the brutal murders of other elderly women but that whoever is out to tarnish her reputation refuses to back off. With her usual blend of cutting-edge forensic science and a stubborn, compelling heroine, Reichs manages to juggle several story lines without losing an ounce of momentum. <em>(Aug.)</em> <br>Copyright © Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. </p><h3>Review</h3><p>“The science is fascinating, and every minute in the morgue with</p><p>Tempe is golden.” —The New York Times Book Review </p> </div>"
}