{
  "book_id": 3933,
  "book_uuid": "120e8de1-d503-4651-af93-e789ec8e5429",
  "title": "The Beautiful Mystery",
  "pubdate": "2012-01-01 06:00:00+00:00",
  "isbn": "",
  "author_name": "Louise Penny",
  "publisher_name": "Minotaur Books",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Mystery"
  ],
  "description": "<div><p>The brilliant new novel in the <em>New York Times</em> bestselling series by Louise Penny, one of the most acclaimed crime writers of our time</p><p>No outsiders are ever admitted to the monastery of Saint-Gilbert-Entre-les-Loups, hidden deep in the wilderness of Quebec, where two dozen cloistered monks live in peace and prayer. They grow vegetables, they tend chickens, they make chocolate. And they sing. Ironically, for a community that has taken a vow of silence, the monks have become world-famous for their glorious voices, raised in ancient chants whose effect on both singer and listener is so profound it is known as “the beautiful mystery.”</p><p>But when the renowned choir director is murdered, the lock on the monastery’s massive wooden door is drawn back to admit Chief Inspector Armand Gamache and Jean-Guy Beauvoir of the Sûreté du Québec. There they discover disquiet beneath the silence, discord in the apparent harmony. One of the brothers, in this life of  prayer and contemplation, has been contemplating murder. As the peace of the monastery crumbles, Gamache is forced to confront some of his own demons, as well as those roaming the remote corridors. Before finding the killer, before restoring peace, the Chief must first consider the divine, the human, and the cracks in between.</p><h3>Review</h3><p>\"With enormous empathy for the troubled human soul—and an ending that makes your blood race and your heart break—Penny continues to raise the bar of her splendid series.\" —<em>People Magazine </em>(4 out 4 stars)<br></p><p>“Louise Penny has crafted an almost perfect crime—haunting, puzzling, brilliant and indeed a most beautiful mystery. Chief Inspector Gamache is one of my favorite characters in fiction. Here he must penetrate a cloistered monastery deep in the northern woods of Quebec, where a murdered monk is his ticket to get in. This is a tour-de-force for Penny, and a thrilling, intelligent read.” <br><strong>—Linda Fairstein</strong></p><p>\"A. Ma. Zing!  A remarkably courageous—and very beautiful—book that leaps the abyss between faith and despair.\" <br><strong>—Diana Gabaldon</strong></p><p>“Elliptical and often oracular… also remarkably penetrating and humane. The most illuminating analogies are not to other contemporary detective fiction but to <em>The Name of the Rose</em> and <em>Murder in the Cathedral</em>.”<br><strong><em>—Kirkus Reviews </em></strong></p><p>“An entire mystery novel centering on Gregorian chants (whose curiously hypnotic allure is called the “beautiful mystery”)? Yes, indeed, and in the hands of the masterful Penny, the topic proves every bit as able to transfix readers as the chants do their listeners.”<br><strong>—<em>Booklist</em> (starred review)</strong></p><p>“Elegant… This heart-rending tale is a marvelous addition to Penny’s acclaimed series. Fans won’t be disappointed.”<br><strong>—<em>Library Journal</em> (starred review)</strong></p><p>“Traditional mystery fans can look forward to a captivating whodunit plot, a clever fair-play clue concealed in plain view, and the deft use of humor to lighten the story’s dark patches. On a deeper level, the crime provides a means for Penny’s unusually empathic, all-too-fallible lead to unearth truths about human passions and weaknesses while avoiding simple answers.”<br><strong>—<em>Publishers Weekly</em> (starred review)</strong></p><h3>About the Author</h3><p>LOUISE PENNY is the <em>New York Times </em>and<em> </em><em>Globe and Mail </em>bestselling author of seven previous novels featuring Chief Inspector Armand Gamache.<em> </em>Her debut, <em>Still Life</em>, won the John Creasey Dagger and the Arthur Ellis, Barry, Anthony, and Dilys Awards, and was named one of the five Mystery/Crime Novels of the Decade by <em>Deadly Pleasures</em> magazine. Penny was the first author ever to win the Agatha Award for Best Novel four times in a row—for <em>A Fatal Grace, The Cruelest Month,</em> and <em>The Brutal Telling (</em>which also received the Anthony Award for Best Novel), and <em>Bury Your Dead</em> (which also won the Dilys, Arthur Ellis, Anthony, Macavity, and Nero Awards). She lives in a small village south of Montréal. </p></div>"
}