{
  "book_id": 3957,
  "book_uuid": "f3b17a6f-fc78-450e-99d8-7a90ff188816",
  "title": "Creation in Death",
  "pubdate": "2008-04-15 20:43:57.319000+00:00",
  "isbn": "",
  "author_name": "Nora Roberts; J. D. Robb",
  "publisher_name": "Christian Large Print",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "Mystery & Detective",
    "Suspense",
    "Detective",
    "Police Procedural",
    "Fiction - Mystery",
    "Women Sleuths",
    "Romance",
    "American Mystery & Suspense Fiction",
    "Mystery fiction",
    "Police",
    "Large type books",
    "Mystery & Detective - Women Sleuths",
    "New York (N.Y.)",
    "New York (State)",
    "New York",
    "Policewomen",
    "Dallas",
    "Eve (Fictitious character)",
    "Police - New York (State) - New York",
    "Romance - Suspense"
  ],
  "description": "EDITORIAL REVIEW: NYPSD Lieutenant Eve Dallas keeps the streets of a near-future New York City safe in this extraordinary series. But even she makes mistakes, and is haunted by those she couldn't save-and the killers she couldn't capture. When the body of a young brunette is found in East River Park, artfully positioned and marked by signs of prolonged and painful torture, Eve is catapulted back to a case nine years earlier. The city was on edge from a killing spree that took the lives of four women in fifteen days, courtesy of a man the media tagged \"The Groom\"-because he put silver rings on the fingers of his victims. When it turns out that the young brunette was employed by Eve's billionaire husband, Roarke, she brings him in on the case-a move that proves fitting when it becomes chillingly clear that the killer has made his attack personal. The victim was washed in products from a store Roarke owns, and laid out on a sheet his company manufactures. With the Groom's monstrous return, Eve is determined to finish him once and for all. Familiar with his methods, Eve knows that he has already grabbed his next victim. Time is running out on another woman's life. And chances are he's working up to the biggest challenge of his illustrious career-abducting a woman who will test his skills and who promises to give him days and days of pleasure before she dies: Eve."
}