{
  "book_id": 3965,
  "book_uuid": "5c87ba63-8f4f-4e95-b877-23a8f87cc4aa",
  "title": "A Wanted Man",
  "pubdate": "2012-09-11 05:00:00+00:00",
  "isbn": "",
  "author_name": "Lee Child",
  "publisher_name": "Delacorte Press",
  "series_name": "",
  "series_index": 1.0,
  "tags": [],
  "description": "<div><p><strong>Reacher is back! <em>A Wanted Man</em> is a new masterpiece of suspense—from #1 <em>New York Times</em> bestselling author Lee Child.</strong><br><br>Four people in a car, hoping to make Chicago by morning. One man driving, eyes on the road. Another man next to him, telling stories that don’t add up. A woman in the back, silent and worried. And next to her, a huge man with a broken nose, hitching a ride east to Virginia.<br><br>An hour behind them, a man lies stabbed to death in an old pumping station. He was seen going in with two others, but he never came out. He has been executed, the knife work professional, the killers vanished. Within minutes, the police are notified.  Within hours, the FBI descends, laying claim to the victim without ever saying who he was or why he was there.<br><br>All Reacher wanted was a ride to Virginia. All he did was stick out his thumb. But he soon discovers he has hitched more than a ride. He has tied himself to a massive conspiracy that makes him a threat—to both sides at once.<br><br>In Lee Child’s white-hot thriller, nothing is what it seems, and nobody is telling the truth. As the tension rises, the twists come fast and furious, keeping readers guessing and gasping until the explosive finale.<br><br><strong>Praise for #1 bestselling author Lee Child and his Reacher series</strong><br><strong> </strong><br>“Child is a superb craftsman of suspense.”—<em>Entertainment Weekly</em><br><br>“The truth about Reacher gets better and better.”—Janet Maslin,<em> The New York Times</em><br><br>“Implausible, irresistible Reacher remains just about the best butt-kicker in thriller-lit.”—<em>Kirkus Reviews</em><br><br>“Like his hero Jack Reacher, Lee Child seems to make no wrong steps.”—Associated Press<br><br>“Lee Child [is] the current poster-boy of American crime fiction.”—<em>Los Angeles Times</em><br><br>“Indisputably the best escape artist in this escapist genre.”—Marilyn Stasio, <em>The New York Times</em><br><br>“Jack Reacher is much more like the heir to the Op and Marlowe than Spenser ever was.”—<em>Esquire</em></p><h3>About the Author</h3><p><strong>Lee Child</strong> is the author of seventeen Jack Reacher thrillers, including the <em>New York Times</em> bestsellers<em> Persuader, The Enemy, One Shot, </em>and<em> The Hard Way,</em> and the #1 bestsellers <em>The Affair,</em> <em>Worth Dying For,</em> <em>61 Hours, Gone Tomorrow, Bad Luck and Trouble, </em>and<em> Nothing to Lose, </em>as well as the short stories “Second Son” and “Deep Down.” His debut,<em> Killing Floor,</em> won both the Anthony and the Barry awards for Best First Mystery, and <em>The Enemy</em> won both the Barry and Nero awards for Best Novel. Foreign rights in the Reacher series have sold in more than forty territories. All titles have been optioned for major motion pictures. A native of England and a former television director, Child lives in New York City, where he is at work on his next thriller, <em>Never Go Back</em>. </p><h3>Excerpt. © Reprinted by permission. All rights reserved.</h3><p>Chapter 1<br></p><p>The eyewitness said he didn’t actually see it happen. But how else could it have gone down? Not long after midnight a man in a green winter coat had gone into a small concrete bunker through its only door. Two men in black suits had followed him in. There had been a short pause. The two men in the black suits had come out again.<br></p><p>The man in the green winter coat had not come out again.<br></p><p>The two men in the black suits had walked thirty brisk feet and climbed into a bright red car. Fire-engine red, the eyewitness called it. Vivid red. Fairly new. A regular four-door sedan, the eyewitness thought. Or maybe a five-door. Or a three-door. But definitely not a two-door coupe. A Toyota, the eyewitness thought. Or maybe a Honda. Or a Hyundai. Maybe a Kia.<br></p><p>But whichever, the two men in the black suits had driven away in it.<br></p><p>There was still no sign of the man in the green winter coat.<br></p><p>Then blood had pooled out from under the concrete bunker’s door.<br></p><p>The eyewitness had called 911.<br></p><p>The county sheriff had shown up and gotten the story. He was good at hustling folk along while looking patient. It was one of his many talents. Eventually the eyewitness had finished up. Then the county sheriff had thought for a long moment. He was in a part of the nation where in every direction there were hundreds of square miles of emptiness just over the dark horizon. Where roads were long lonely ribbons.<br></p><p>He was in roadblock country.<br></p><p>So he had called the highway patrol, and then he had ordered up the helicopter from the state capital. He had put out an urgent APB on a bright red import carrying two men in black suits.<br></p><p>Jack Reacher rode for ninety miles and ninety minutes with a woman in a dirty gray van, and then he saw bright vapor lights up ahead at the highway cloverleaf, with big green signs pointing west and east. The woman slowed the van, and stopped, and Reacher got out and thanked her and waved her away. She used the first ramp, west toward Denver and Salt Lake City, and he walked under the bridge and set up on the eastbound ramp, one foot on the shoulder and one in the traffic lane, and he stuck out his thumb and smiled and tried to look friendly.<br></p><p>Which was not easy. Reacher was a big man, six feet five inches tall, heavily built, and that night as always he looked a little ragged and unkempt. Lonely drivers wanted pleasant and unthreatening company, and Reacher knew from long experience that visually he was no one’s first choice of companion. Too intimidating. And right then he was further handicapped by a freshly broken nose. He had patched the injury with a length of silver duct tape, which he knew must make him look even more grotesque. He knew the tape must be shining and glittering in the yellow light. But he felt the tape was helping him medically, so he decided to keep it in place for the first hour. If he didn’t get a ride inside sixty minutes, he would consider peeling it off.<br></p><p>He didn’t get a ride inside sixty minutes. Traffic was light. Nebraska, at night, in the wintertime. The cloverleaf he was at was the only significant interchange for miles around, but even so whole minutes passed with no action at all. Up on the bridge the through traffic was fairly steady, but few people seemed keen to join it. In the first hour only forty vehicles showed up to turn east. Cars, trucks, SUVs, different makes, different models, different colors. Thirty of them blew past without even slowing. Ten drivers checked him out and then looked away and accelerated onward.<br></p><p>Not unusual. Hitchhiking had been getting harder for years.<br></p><p>Time to shorten the odds.<br></p><p>He turned away and used a splintered thumbnail to pick at the edge of the duct tape on his face. He got half an inch of it loose and gripped that makeshift tab between the pad of his thumb and his forefinger. Two schools of thought. One went for the fast rip. The other advocated a slow peel. An illusory choice, Reacher thought. The pain was the same either way. So he split the difference and opted for a fast peel. No big deal on his cheek. A different story across his nose. Cuts reopened, the swelling lifted and moved, the fracture itself clicked and ground.<br></p><p>No big deal on the other cheek.<br></p><p>He rolled the bloodied tape into a cylinder and stuck it in his pocket. He spat on his fingers and wiped his face. He heard a helicopter a thousand feet overhead and saw a high-power searchlight beam stabbing down through the darkness, resting here, resting there, moving on. He turned back and put one foot in the traffic lane again and stuck out his thumb. The helicopter hung around for a spell and then lost interest and hammered away west until its noise died back to nothing. Traffic heading cross-country on the bridge stayed sparse but steady. Feeder traffic heading north and south on the county road got thinner. But almost all of it turned one way or the other on the highway. Almost none of it continued straight. Reacher remained optimistic.<br></p><p>The night was cold, which helped his face. Numbness dulled the ache. A pick-up truck with Kansas plates came out of the south and turned east and slowed to a roll. The driver was a rangy black guy bundled into a thick coat. Maybe his heater wasn’t working. He eyeballed Reacher long and hard. He almost stopped. But he didn’t. He looked away and drove on by.<br></p><p>Reacher had money in his pocket. If he could get to Lincoln or Omaha he could get a bus. But he couldn’t get to Lincoln or Omaha. Not without a ride. He took to tucking his right hand under his left arm between cars, to stop it from freezing. He stamped his feet. His breath pooled around his head like a cloud. A highway patrol cruiser blew by with lights but no siren. Two cops inside. They didn’t even glance Reacher’s way. Their focus was up ahead. Some kind of an incident, maybe.<br></p><p>Two more cars almost stopped. One out of the south, and one out of the north, minutes apart. They both slowed, stumbled, stuttered, eyeballed, and then picked up speed and drove on by. Getting closer, Reacher thought. It’s coming. Maybe the late hour was helping. People were more compassionate at midnight than midday. And night driving already felt a little out of the ordinary. Picking up a random stranger wasn’t such a big leap.<br></p><p>He hoped.<br></p><p>Another driver took a good long look, but kept on going.<br></p><p>And another.<br></p><p>Reacher spat on his palms and slicked his hair into place.<br></p><p>He kept the smile on his face.<br></p><p>He remained optimistic.<br></p><p>And then finally, after a total of ninety-three minutes on the ramp, a car stopped for him.<br></p><p>Chapter 2<br></p><p>The car stopped thirty feet upstream of him. It had a local plate, and was a reasonable size, and American, and dark in color. A Chevrolet, Reacher thought, probably dark blue, or gray, or black. It was hard to tell, in the vapor light. Dark metallics were always anonymous at night.<br></p><p>There were three people in the car. Two men in the front, and a woman in the back. The two men were twisted around in their seats, like there was a big three-way discussion going on. Like a democracy. Should we pick this guy up or not? Which suggested to Reacher that the three people didn’t know each other very well. Such decisions among good friends were usually instinctive. These three were business colleagues, maybe, a team of equals, thrown together for the duration, exaggeratedly respectful of each other’s positions, especially the outnumbered woman’s.<br></p><p>Reacher saw the woman nod, and he lip-read her yes, and the men turned back and faced front again, and the car rolled forward. It stopped again with the front passenger’s window alongside Reacher’s hip. The glass came down. Reacher bent at the waist and felt warmth on his face. This car’s heater was working just fine. That was for damn sure.<br></p><p>The guy in the front passenger seat asked, “Where are you headed tonight, sir?”<br></p><p>Reacher had been a cop in the army for thirteen years, and then for almost as long had lived on his wits, and he had survived both phases of his life by being appropriately cautious and by staying alert. All five senses, all the time. Deciding whether or not to take an offered ride depended mostly on smell. Could he smell beer? Weed? Bourbon? But right then he could smell nothing at all. His nose had just been broken. His nasal passages were clogged with blood and swellings. Maybe his septum was permanently deviated. It felt entirely possible he would never smell anything ever again.<br></p><p>Touch was not an option in that situation, either. Nor was taste. He would learn nothing by groping around like a blind man, or by licking things. Which left sight and sound. He heard neutral tones from the front passenger, no marked regional accent, an educated cadence, an air of authority and executive experience. On all three of them he saw soft uncalloused hands, unmuscled frames, neat hair, no tans. Indoor people. Office folk. Not at the top of the tree, but a long way from the bottom. They each looked somewhere in their middle forties, perhaps halfway through their lives, but more than halfway through their careers. Like lieutenant colonels, maybe, in army terms. Solid achievers, but not superstars.<br></p><p>Each of them had on black pants and a blue denim shirt. Like uniforms. The shirts looked cheap and new, still creased from the wrapper. A team-building exercise, Reacher figured. Some kind of corporate bullshit. Fly a bunch of middle-ranking executives out from their regional offices, get them together in the wilderness, give them shirts, set them tasks. Maybe all the hoo-hah was making them feel a little bit adventurous, which was why they were picking him up. And maybe there would be candid mutual critiquing afterward, which was why they had labored through the big three-way democratic discussion. Teams needed teamwork, and teamwork needed consensus, and consensus needed to be unforced, and gender issues were always sensitive. In fact Reacher was a littl... </p></div>"
}