{
  "book_id": 3984,
  "book_uuid": "2258cf22-56a6-4cf6-92cc-a99ffe20efdb",
  "title": "Free Fall in Crimson: Introduction by Lee Child: Travis McGee, No. 19",
  "pubdate": "2013-12-05 20:18:27.490229+00:00",
  "isbn": "",
  "author_name": "John D MacDonald",
  "publisher_name": "Transworld",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "General",
    "Mystery & Detective",
    "Crime"
  ],
  "description": "<p>'MacDonald had a huge influence on me . . . Reacher is like a fully detached version of Travis McGee' LEE CHILD Travis McGee isn’t your typical knight in shining armour. He only works when his cash runs out, and his rule is simple: He’ll help you find whatever was taken from you, as long as he can keep half. Ellis Esterland was rich, mean, and slowly succumbing to cancer – until someone hastened the inevitable by beating him to death. His son wants Travis McGee to find out who killed his estranged father. The ‘why’ seems obvious: his hotly contested, multimillion-dollar estate.</p>\n\n<p>McGee’s quest takes him from Hollywood to the Midwest, from prostitution rings to drug deals gone wrong. In the haze of violence surrounding him, McGee is in danger of losing himself. But one thing remains crystal clear: he is on the trail of a killer conjured from his worst nightmares.</p>\n\n<p>First published in 1981, Free Fall in Crimson features an introduction by Lee ChildJOHN D. MACDONALD: A GRAND MASTER CRIME WRITER'The great entertainer of our age, and a mesmerizing storyteller' - Stephen King'Travis McGee is my favourite fiction detective. He’s great because he has a philosophical side – he will fight a bunch of mobsters in a car park and then have a muse about life, the universe and everything' - Tony Parsons'A dominant influence on writers crafting the continuing series character . . . I envy the generation of readers just discovering Travis McGee' - Sue Grafton'The consummate pro, a master storyteller and witty observer . . . The Travis McGee novels are among the finest works of fiction ever penned by an American author and they retain a remarkable sense of freshness' - Jonathan Kellerman'. . . my favorite novelist of all time' - Dean Koontz'A master storyteller, a masterful suspense writer . . . John D. MacDonald is a shining example for all of us in the field' - Mary Higgins Clark'What a joy that these timeless and treasured novels are available again' - Ed McBain'There’s only one thing as good as reading a John D. MacDonald novel: reading it again . . . He is the all-time master of the American mystery novel' - John Saul</p>"
}