{
  "book_id": 3986,
  "book_uuid": "57cc1a51-b195-4da1-b3ad-73437ec0cd0a",
  "title": "The Fever Series 5-Book Bundle: Darkfever, Bloodfever, Faefever, Dreamfever, Shadowfever",
  "pubdate": "2012-09-17 20:24:27.771915+00:00",
  "isbn": "",
  "author_name": "Karen Marie Moning",
  "publisher_name": "Random House Publishing Group",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "Fantasy",
    "Romance",
    "Paranormal"
  ],
  "description": "<p>In the blockbuster Fever series, Karen Marie Moning creates a darkly sensual and paranormal world, torn apart by the struggle between humans and Fae. Now in a convenient eBook bundle, here are the five thrillingly sexy novels featuring heroine MacKayla Lane: Darkfever, Bloodfever, Faefever, Dreamfever, and Shadowfever.   “Give yourself a treat and read outside the box.”—Charlaine Harris, on Darkfever   Darkfever   When her sister is murdered, MacKayla Lane journeys to Ireland in search of answers. There, she makes a startling discovery: She’s a sidhe-seer, which gives her the rare power to glimpse beyond the realm of Man, and into the dangerous realm of the Fae. As the boundary between the worlds begins to crumble, Mac becomes a target. But her mission is clear: Find the Sinsar Dubh, an ancient book that contains the key to controlling mortals and Fae alike, before the enemy seizes it.   Bloodfever   In her fight to stay alive, Mac must hunt the Sinsar Dubh—a book of the blackest magic imaginable. Pursued by assassins and surrounded by mysterious figures she knows she cannot trust, Mac finds herself torn between two powerful men: V’lane, the ancient, immortal Fae Prince, and Jericho Barrons, a man as seductive as he is dangerous.   Faefever   When Mac receives a page torn from her sister’s journal, she is stunned by its desperate contents. Now that Mac knows her sister’s killer is close, she’s on the hunt for revenge. Forced into a precarious alliance with V’lane, the lethal Fae prince, and Jericho Barrons, a man of deadly secrets, Mac is soon locked in a battle for her body, mind, and soul.   Dreamfever   When the walls between Man and Fae come crashing down, Mac is caught in a lethal trap. Captured by the Fae Lord Master, she is left with no memory of who or what she is: the only sidhe-seer alive who can track the Sinsar Dubh. Clawing her way back from oblivion is only the first step Mac must take down a perilous path, from the battle-filled streets of Dublin into the realm of the Fae, where nothing is as it seems.   Shadowfever   In an epic battle between humans and Fae, the Sinsar Dubh turns on Mac, and begins to mow a deadly path through those she loves. Who can she trust? But more important, who is Mac? Does an ancient prophecy reveal her destiny? Mac’s journey will force her to face the truth, and to make a choice that will either save the world . . . or destroy it.   “Delectably dark and sexy . . . spiced with a subtle yet delightfully sharp sense of humor.”—Chicago Tribune, on Bloodfever   Includes an electrifying excerpt from Karen Marie Moning’s new novel, Iced.</p>"
}