{
  "book_id": 3992,
  "book_uuid": "e151b52e-336a-40f9-bbb9-717c177d10e6",
  "title": "Spin",
  "pubdate": "2006-02-07 15:28:35.498533+00:00",
  "isbn": "",
  "author_name": "Robert Charles Wilson",
  "publisher_name": "Macmillan",
  "series_name": "",
  "series_index": 1.0,
  "tags": [
    "Fiction",
    "General",
    "Science Fiction",
    "Time Travel",
    "Apocalyptic & Post-Apocalyptic",
    "Alien Contact"
  ],
  "description": "<p>Spin is Robert Charles Wilson's Hugo Award-winning masterpiece—a stunning combination of a galactic \"what if\" and a small-scale, very human story.</p>\n\n<p>One night in October when he was ten years old, Tyler Dupree stood in his back yard and watched the stars go out. They all flared into brilliance at once, then disappeared, replaced by a flat, empty black barrier. He and his best friends, Jason and Diane Lawton, had seen what became known as the Big Blackout. It would shape their lives. The effect is worldwide. The sun is now a featureless disk—a heat source, rather than an astronomical object. The moon is gone, but tides remain. Not only have the world's artificial satellites fallen out of orbit, their recovered remains are pitted and aged, as though they'd been in space far longer than their known lifespans. As Tyler, Jason, and Diane grow up, a space probe reveals a bizarre truth: The barrier is artificial, generated by huge alien artifacts. Time is passing faster outside the barrier than inside—more than a hundred million years per year on Earth. At this rate, the death throes of the sun are only about forty years in our future. Jason, now a promising young scientist, devotes his life to working against this slow-moving apocalypse. Diane throws herself into hedonism, marrying a sinister cult leader who's forged a new religion out of the fears of the masses.</p>\n\n<p>Earth sends terraforming machines to Mars to let the onrush of time do its work, turning the planet green. Next they send humans...and immediately get back an emissary with thousands of years of stories to tell about the settling of Mars. Then Earth's probes reveal that an identical barrier has appeared around Mars. Jason, desperate, seeds near space with self-replicating machines that will scatter copies of themselves outward from the sun—and report back on what they find. Life on Earth is about to get much, much stranger.</p>"
}